#loc = loc(unknown)
#loc1 = loc("images")
#loc2 = loc("images/model.0/conv/Conv_output_0_Conv_si8")
module @yolov8s attributes {module.FLOPs = 28709930000 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "cv181x", module.cores = 1 : i64, module.devices = 1 : i64, module.inputs = ["images"], module.mode = "INT8", module.outputs = ["/model.22/Sigmoid_output_0_Sigmoid_f32", "/model.22/dfl/conv/Conv_output_0_Conv_f32"], module.platform = "ONNX", module.q_group_size = 0 : i64, module.state = "TPU_ADDRESSED", module.weight_file = "yolov8s_tpu_addressed_cv181x_int8_sym_weight.npz"} {
  module @yolov8s attributes {module.coeff_addr = 1099511627776 : i64, module.coeff_size = 11231792 : i64, module.device_id = 0 : i64, module.neuron_size = 4096000 : i64, module.private_size = 1228800 : i64, module.step = 0 : i64} {
    func.func @main(%arg0: tensor<1x3x640x640xf32> loc(unknown)) -> (tensor<1x1x8400xf32, 5497558138880 : i64>, tensor<1x1x4x8400xf32, 4398046511104 : i64>) {
      %0 = "top.Input"(%arg0) {black_level = 1.120000e+02 : f64, channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [640, 640], scale = [0.0039215688593685627, 0.0039215688593685627, 0.0039215688593685627], white_level = 4.095000e+03 : f64} : (tensor<1x3x640x640xf32>) -> tensor<1x3x640x640x!quant.calibrated<f32<-1.000000e+00:1.000000e+00>>, 3298534883328 : i64> loc(#loc1)
      %1 = call @subfunc_0(%0) : (tensor<1x3x640x640x!quant.calibrated<f32<-1.000000e+00:1.000000e+00>>, 3298534883328 : i64>) -> tensor<1x3x640x640x!quant.uniform<i8:f32, 0.0078740157480314959>, 2199023255552 : i64> loc(#loc)
      %2:2 = call @subfunc_1(%1) : (tensor<1x3x640x640x!quant.uniform<i8:f32, 0.0078740157480314959>, 2199023255552 : i64>) -> (tensor<1x1x8400xf32, 5497558138880 : i64>, tensor<1x1x4x8400xf32, 4398046511104 : i64>) loc(#loc)
      return %2#0, %2#1 : tensor<1x1x8400xf32, 5497558138880 : i64>, tensor<1x1x4x8400xf32, 4398046511104 : i64> loc(#loc)
    } loc(#loc)
    func.func @subfunc_0(%arg0: tensor<1x3x640x640x!quant.calibrated<f32<-1.000000e+00:1.000000e+00>>, 3298534883328 : i64> loc("images")) -> tensor<1x3x640x640x!quant.uniform<i8:f32, 0.0078740157480314959>, 2199023255552 : i64> attributes {id = 0 : i64, mode = #tpu<run_mode CPU>, next_index = array<i32: 1>} {
      %0 = "tpu.GenericCpu"(%arg0) {cpu_op_name = "quant", param = {from = "FP32", scale = 1.270000e+02 : f32, to = "INT8"}} : (tensor<1x3x640x640x!quant.calibrated<f32<-1.000000e+00:1.000000e+00>>, 3298534883328 : i64>) -> tensor<1x3x640x640x!quant.uniform<i8:f32, 0.0078740157480314959>, 2199023255552 : i64> loc(#loc2)
      return %0 : tensor<1x3x640x640x!quant.uniform<i8:f32, 0.0078740157480314959>, 2199023255552 : i64> loc(#loc)
    } loc(#loc)
    func.func @subfunc_1(%arg0: tensor<1x3x640x640x!quant.uniform<i8:f32, 0.0078740157480314959>, 2199023255552 : i64> loc("images/model.0/conv/Conv_output_0_Conv_si8")) -> (tensor<1x1x8400xf32, 5497558138880 : i64>, tensor<1x1x4x8400xf32, 4398046511104 : i64>) attributes {id = 1 : i64, mode = #tpu<run_mode TPU_STATIC>, next_index = array<i32: -1>} {
      %0 = "top.None"() : () -> none loc(#loc)
      %1 = "top.Weight"() : () -> tensor<1x32x1x9xi8, 1099517768960 : i64> loc(#loc3)
      %2 = "top.Weight"() : () -> tensor<1x32x9x4xsi8, 1099517767808 : i64> loc(#loc4)
      %3 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099514162832 : i64> loc(#loc5)
      %4 = "top.Weight"() : () -> tensor<1x64x1x9xi8, 1099521361248 : i64> loc(#loc6)
      %5 = "top.Weight"() : () -> tensor<1x64x9x32xsi8, 1099512975184 : i64> loc(#loc7)
      %6 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099517919840 : i64> loc(#loc8)
      %7 = "tpu.Group"(%arg0) ({
        %302 = "tpu.Load"(%arg0) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 12160, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [3], d_idx = [0], d_slice = [1], h_idx = [0, 13, 29, 45, 61, 77, 93, 109, 125, 141, 157, 173, 189, 205, 221, 237, 253, 269, 285, 301, 317, 333, 349, 365, 381, 397, 413, 429, 445, 461, 477, 493, 509, 525, 541, 557, 573, 589, 605, 621], h_slice = [16, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19], w_idx = [0], w_slice = [640], id = 0, stage = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 4 : i64} : (tensor<1x3x640x640x!quant.uniform<i8:f32, 0.0078740157480314959>, 2199023255552 : i64>) -> tensor<1x3x640x640x!quant.uniform<i8:f32, 0.0078740157480314959>> loc(#loc10)
        %303 = "tpu.Load"(%2) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24064, out_size = 144, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [4], id = 1, stage = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x9x4xsi8, 1099517767808 : i64>) -> tensor<1x32x9x4xsi8> loc(#loc11)
        %304 = "tpu.Load"(%1) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12160, out_size = 36, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 2, stage = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x9xi8, 1099517768960 : i64>) -> tensor<1x32x1x9xi8> loc(#loc12)
        %305 = "tpu.Load"(%3) {do_bcast = true, ginfo = #tpu.lg<out_addr = 24208, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 3, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099514162832 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc13)
        %306 = "tpu.Conv2D"(%302, %303, %304) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 11520, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 7, 15, 23, 31, 39, 47, 55, 63, 71, 79, 87, 95, 103, 111, 119, 127, 135, 143, 151, 159, 167, 175, 183, 191, 199, 207, 215, 223, 231, 239, 247, 255, 263, 271, 279, 287, 295, 303, 311], h_slice = [8, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9], w_idx = [0], w_slice = [320], id = 4, stage = 1, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, strides = [2, 2], use_3ic_optimize = 4 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x3x640x640x!quant.uniform<i8:f32, 0.0078740157480314959>>, tensor<1x32x9x4xsi8>, tensor<1x32x1x9xi8>) -> tensor<1x32x320x320x!quant.uniform<i8:f32, 0.468737768503937>> loc(#loc14)
        %307 = "tpu.Load"(%5) {do_bcast = false, ginfo = #tpu.lg<out_addr = 29696, out_size = 2304, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [32], id = 5, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x9x32xsi8, 1099512975184 : i64>) -> tensor<1x64x9x32xsi8> loc(#loc15)
        %308 = "tpu.Load"(%4) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12208, out_size = 72, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 6, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x9xi8, 1099521361248 : i64>) -> tensor<1x64x1x9xi8> loc(#loc16)
        %309 = "tpu.Lut"(%306, %305) {ginfo = #tpu.lg<out_addr = 0, out_size = 11520, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 7, 15, 23, 31, 39, 47, 55, 63, 71, 79, 87, 95, 103, 111, 119, 127, 135, 143, 151, 159, 167, 175, 183, 191, 199, 207, 215, 223, 231, 239, 247, 255, 263, 271, 279, 287, 295, 303, 311], h_slice = [8, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9], w_idx = [0], w_slice = [320], id = 7, stage = 1, group_type = 0>} : (tensor<1x32x320x320x!quant.uniform<i8:f32, 0.468737768503937>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x320x320x!quant.uniform<i8:f32, 0.43493836614173226>> loc(#loc17)
        %310 = "tpu.Load"(%6) {do_bcast = true, ginfo = #tpu.lg<out_addr = 23808, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 8, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099517919840 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc18)
        %311 = "tpu.Conv2D"(%309, %307, %308) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48, 52, 56, 60, 64, 68, 72, 76, 80, 84, 88, 92, 96, 100, 104, 108, 112, 116, 120, 124, 128, 132, 136, 140, 144, 148, 152, 156], h_slice = [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4], w_idx = [0], w_slice = [160], id = 9, stage = 1, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, strides = [2, 2], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x320x320x!quant.uniform<i8:f32, 0.43493836614173226>>, tensor<1x64x9x32xsi8>, tensor<1x64x1x9xi8>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.68807983385826776>> loc(#loc19)
        %312 = "tpu.Lut"(%311, %310) {ginfo = #tpu.lg<out_addr = 24576, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48, 52, 56, 60, 64, 68, 72, 76, 80, 84, 88, 92, 96, 100, 104, 108, 112, 116, 120, 124, 128, 132, 136, 140, 144, 148, 152, 156], h_slice = [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4], w_idx = [0], w_slice = [160], id = 10, stage = 1, group_type = 0>} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.68807983385826776>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.71302666220472444>> loc(#loc9)
        %313 = "tpu.Store"(%312) {ginfo = #tpu.lg<out_addr = 24576, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48, 52, 56, 60, 64, 68, 72, 76, 80, 84, 88, 92, 96, 100, 104, 108, 112, 116, 120, 124, 128, 132, 136, 140, 144, 148, 152, 156], h_slice = [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4], w_idx = [0], w_slice = [160], id = 11, stage = 2, group_type = 0>, support_compress = true} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.71302666220472444>>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.71302666220472444>, 0 : i64> loc(#loc9)
        "tpu.Yield"(%313) : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.71302666220472444>, 0 : i64>) -> () loc(#loc9)
      }) {csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 3, 11, -2, 7, 5, 6, -3, 9, 8, -4, 10, 0, 1, 2], group_type = 0 : i64, hsecs = 40 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [-4, 1, 2], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x3x640x640x!quant.uniform<i8:f32, 0.0078740157480314959>, 2199023255552 : i64>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.71302666220472444>, 0 : i64> loc(#loc9)
      %8 = "top.Weight"() : () -> tensor<1x64x1x9xi8, 1099518001632 : i64> loc(#loc20)
      %9 = "top.Weight"() : () -> tensor<1x64x1x64xsi8, 1099516430288 : i64> loc(#loc21)
      %10 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099517471952 : i64> loc(#loc22)
      %11 = "tpu.Group"(%7) ({
        %302 = "tpu.Load"(%7) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 10240, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48, 56, 64, 72, 80, 88, 96, 104, 112, 120, 128, 136, 144, 152], h_slice = [8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [160], id = 0, stage = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.71302666220472444>, 0 : i64>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.71302666220472444>> loc(#loc24)
        %303 = "tpu.Load"(%9) {do_bcast = false, ginfo = #tpu.lg<out_addr = 10240, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [64], id = 1, stage = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x64xsi8, 1099516430288 : i64>) -> tensor<1x64x1x64xsi8> loc(#loc25)
        %304 = "tpu.Load"(%8) {do_bcast = false, ginfo = #tpu.lg<out_addr = 11008, out_size = 72, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 2, stage = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x9xi8, 1099518001632 : i64>) -> tensor<1x64x1x9xi8> loc(#loc26)
        %305 = "tpu.Load"(%10) {do_bcast = true, ginfo = #tpu.lg<out_addr = 10752, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 3, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099517471952 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc27)
        %306 = "tpu.Conv2D"(%302, %303, %304) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 0, out_size = 10240, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48, 56, 64, 72, 80, 88, 96, 104, 112, 120, 128, 136, 144, 152], h_slice = [8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [160], id = 4, stage = 1, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.71302666220472444>>, tensor<1x64x1x64xsi8>, tensor<1x64x1x9xi8>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.42168459527559055>> loc(#loc28)
        %307 = "tpu.Lut"(%306, %305) {ginfo = #tpu.lg<out_addr = 22528, out_size = 10240, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48, 56, 64, 72, 80, 88, 96, 104, 112, 120, 128, 136, 144, 152], h_slice = [8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [160], id = 5, stage = 1, group_type = 0>} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.42168459527559055>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.23781815511811022>> loc(#loc23)
        %308 = "tpu.Store"(%307) {ginfo = #tpu.lg<out_addr = 22528, out_size = 10240, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48, 56, 64, 72, 80, 88, 96, 104, 112, 120, 128, 136, 144, 152], h_slice = [8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [160], id = 6, stage = 2, group_type = 0>, support_compress = true} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.23781815511811022>>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.23781815511811022>, 1638400 : i64> loc(#loc23)
        "tpu.Yield"(%308) : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.23781815511811022>, 1638400 : i64>) -> () loc(#loc23)
      }) {csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 3, 6, -2, 5, 0, 1, 2], group_type = 0 : i64, hsecs = 20 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], self_down_overlap_op = [], self_up_overlap_op = [2, 1], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.71302666220472444>, 0 : i64>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.23781815511811022>, 1638400 : i64> loc(#loc23)
      %12 = "tpu.Slice"(%11, %0, %0, %0, %0) {axes = [], ends = [-1, 32, -1, -1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.23781815511811022>, 1638400 : i64>, none, none, none, none) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>, 1638400 : i64> loc(#loc29)
      %13 = "tpu.Slice"(%11, %0, %0, %0, %0) {axes = [], ends = [-1, 64, -1, -1], offset = [0, 32, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.23781815511811022>, 1638400 : i64>, none, none, none, none) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>, 2457600 : i64> loc(#loc30)
      %14 = "top.Weight"() {do_compress = true} : () -> tensor<1x32x1x9xi8, 1099517472352 : i64> loc(#loc31)
      %15 = "top.Weight"() {do_compress = true} : () -> tensor<1x32x9x32xsi8, 1099514757584 : i64> loc(#loc32)
      %16 = "tpu.Conv2D"(%13, %15, %14) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>, 2457600 : i64>, tensor<1x32x9x32xsi8, 1099514757584 : i64>, tensor<1x32x1x9xi8, 1099517472352 : i64>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.30551811259842521>, 0 : i64> loc(#loc33)
      %17 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099514799824 : i64> loc(#loc34)
      %18 = "top.Weight"() : () -> tensor<1x32x1x9xi8, 1099518053168 : i64> loc(#loc35)
      %19 = "top.Weight"() : () -> tensor<1x32x9x32xsi8, 1099522357856 : i64> loc(#loc36)
      %20 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099521367584 : i64> loc(#loc37)
      %21 = "tpu.Group"(%16) ({
        %302 = "tpu.Load"(%16) {do_bcast = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 7680, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 9, 19, 29, 39, 49, 59, 69, 79, 89, 99, 109, 119, 129, 139, 149], h_slice = [11, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 11], w_idx = [0], w_slice = [160], id = 0, stage = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.30551811259842521>, 0 : i64>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.30551811259842521>> loc(#loc39)
        %303 = "tpu.Load"(%17) {do_bcast = true, ginfo = #tpu.lg<out_addr = 7936, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 1, stage = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099514799824 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc40)
        %304 = "tpu.Load"(%19) {do_bcast = false, ginfo = #tpu.lg<out_addr = 30976, out_size = 1152, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [32], id = 2, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x9x32xsi8, 1099522357856 : i64>) -> tensor<1x32x9x32xsi8> loc(#loc41)
        %305 = "tpu.Load"(%18) {do_bcast = false, ginfo = #tpu.lg<out_addr = 15872, out_size = 36, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 3, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x9xi8, 1099518053168 : i64>) -> tensor<1x32x1x9xi8> loc(#loc42)
        %306 = "tpu.Lut"(%302, %303) {ginfo = #tpu.lg<out_addr = 0, out_size = 7680, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 9, 19, 29, 39, 49, 59, 69, 79, 89, 99, 109, 119, 129, 139, 149], h_slice = [11, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 11], w_idx = [0], w_slice = [160], id = 4, stage = 1, group_type = 0>} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.30551811259842521>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.2259418968503937>> loc(#loc43)
        %307 = "tpu.Load"(%20) {do_bcast = true, ginfo = #tpu.lg<out_addr = 7680, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 5, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099521367584 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc44)
        %308 = "tpu.Conv2D"(%306, %304, %305) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 6400, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150], h_slice = [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10], w_idx = [0], w_slice = [160], id = 6, stage = 1, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.2259418968503937>>, tensor<1x32x9x32xsi8>, tensor<1x32x1x9xi8>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.25557005905511809>> loc(#loc45)
        %309 = "tpu.Lut"(%308, %307) {ginfo = #tpu.lg<out_addr = 24576, out_size = 6400, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150], h_slice = [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10], w_idx = [0], w_slice = [160], id = 7, stage = 1, group_type = 0>} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.25557005905511809>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.215743762992126>> loc(#loc38)
        %310 = "tpu.Store"(%309) {ginfo = #tpu.lg<out_addr = 24576, out_size = 6400, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150], h_slice = [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10], w_idx = [0], w_slice = [160], id = 8, stage = 2, group_type = 0>, support_compress = true} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.215743762992126>>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.215743762992126>, 3276800 : i64> loc(#loc38)
        "tpu.Yield"(%310) : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.215743762992126>, 3276800 : i64>) -> () loc(#loc38)
      }) {csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 2, 3, 8, -2, 6, 5, -3, 7, 0, 1], group_type = 0 : i64, hsecs = 16 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [-3, 1], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.30551811259842521>, 0 : i64>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.215743762992126>, 3276800 : i64> loc(#loc38)
      %22 = "top.Weight"() : () -> tensor<1x64x1x9xi8, 1099517771552 : i64> loc(#loc46)
      %23 = "top.Weight"() : () -> tensor<1x64x1x96xsi8, 1099517958624 : i64> loc(#loc47)
      %24 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099516879056 : i64> loc(#loc48)
      %25 = "tpu.Group"(%13, %21, %12) ({
        %302 = "tpu.Load"(%13) {do_bcast = false, ginfo = #tpu.lg<out_addr = 20480, out_size = 3840, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 6, 12, 18, 24, 30, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96, 102, 108, 114, 120, 126, 132, 138, 144, 150, 155], h_slice = [6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 5, 5], w_idx = [0], w_slice = [160], id = 0, stage = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>, 2457600 : i64>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>> loc(#loc50)
        %303 = "tpu.Load"(%21) {do_bcast = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 3840, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 6, 12, 18, 24, 30, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96, 102, 108, 114, 120, 126, 132, 138, 144, 150, 155], h_slice = [6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 5, 5], w_idx = [0], w_slice = [160], id = 1, stage = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.215743762992126>, 3276800 : i64>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.215743762992126>> loc(#loc51)
        %304 = "tpu.Load"(%12) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 3840, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 6, 12, 18, 24, 30, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96, 102, 108, 114, 120, 126, 132, 138, 144, 150, 155], h_slice = [6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 5, 5], w_idx = [0], w_slice = [160], id = 2, stage = 1, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>, 1638400 : i64>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>> loc(#loc52)
        %305 = "tpu.Add"(%302, %303) {do_relu = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 3840, buffer_addr = 25344, buffer_size = 3840, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 6, 12, 18, 24, 30, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96, 102, 108, 114, 120, 126, 132, 138, 144, 150, 155], h_slice = [6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 5, 5], w_idx = [0], w_slice = [160], id = 3, stage = 1, group_type = 0>, multipliers = [113, 102], relu_limit = -1.000000e+00 : f64, rshifts = [7]} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>>, tensor<1x32x160x160x!quant.uniform<i8:f32, 0.215743762992126>>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.26931933149606302>> loc(#loc53)
        %306 = "tpu.Load"(%23) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 768, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [96], id = 4, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x96xsi8, 1099517958624 : i64>) -> tensor<1x64x1x96xsi8> loc(#loc54)
        %307 = "tpu.Load"(%22) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12032, out_size = 72, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 5, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x9xi8, 1099517771552 : i64>) -> tensor<1x64x1x9xi8> loc(#loc55)
        %308 = "tpu.Concat"(%304, %302, %305) {axis = 1 : si32, do_relu = false, ginfo = #tpu.lg<out_addr = 0, out_size = 11520, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [96], d_idx = [0], d_slice = [1], h_idx = [0, 6, 12, 18, 24, 30, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96, 102, 108, 114, 120, 126, 132, 138, 144, 150, 155], h_slice = [6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 5, 5], w_idx = [0], w_slice = [160], id = 6, stage = 1, group_type = 0>, multipliers = [115, 115, 65], only_merge = false, relu_limit = -1.000000e+00 : f64, rshifts = [7, 7, 6]} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>>, tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>>, tensor<1x32x160x160x!quant.uniform<i8:f32, 0.26931933149606302>>) -> tensor<1x96x160x160x!quant.uniform<i8:f32, 0.26296856299212601>> loc(#loc56)
        %309 = "tpu.Load"(%24) {do_bcast = true, ginfo = #tpu.lg<out_addr = 29184, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 7, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099516879056 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc57)
        %310 = "tpu.Conv2D"(%308, %306, %307) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 7680, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 6, 12, 18, 24, 30, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96, 102, 108, 114, 120, 126, 132, 138, 144, 150, 155], h_slice = [6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 5, 5], w_idx = [0], w_slice = [160], id = 8, stage = 1, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x96x160x160x!quant.uniform<i8:f32, 0.26296856299212601>>, tensor<1x64x1x96xsi8>, tensor<1x64x1x9xi8>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.20622726535433072>> loc(#loc58)
        %311 = "tpu.Lut"(%310, %309) {ginfo = #tpu.lg<out_addr = 0, out_size = 7680, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 6, 12, 18, 24, 30, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96, 102, 108, 114, 120, 126, 132, 138, 144, 150, 155], h_slice = [6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 5, 5], w_idx = [0], w_slice = [160], id = 9, stage = 1, group_type = 0>} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.20622726535433072>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.12394116614173228>> loc(#loc49)
        %312 = "tpu.Store"(%311) {ginfo = #tpu.lg<out_addr = 0, out_size = 7680, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 6, 12, 18, 24, 30, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96, 102, 108, 114, 120, 126, 132, 138, 144, 150, 155], h_slice = [6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 5, 5], w_idx = [0], w_slice = [160], id = 10, stage = 2, group_type = 0>, support_compress = true} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.12394116614173228>>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.12394116614173228>, 0 : i64> loc(#loc49)
        "tpu.Yield"(%312) : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.12394116614173228>, 0 : i64>) -> () loc(#loc49)
      }) {csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 3, 2, 10, -2, 6, 4, 5, -3, 8, 7, -4, 9, 0, 1], group_type = 0 : i64, hsecs = 27 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [-4, 2], self_down_overlap_op = [], self_up_overlap_op = [1], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>, 2457600 : i64>, tensor<1x32x160x160x!quant.uniform<i8:f32, 0.215743762992126>, 3276800 : i64>, tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>, 1638400 : i64>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.12394116614173228>, 0 : i64> loc(#loc49)
      %26 = "top.Weight"() : () -> tensor<1x128x1x9xi8, 1099516582992 : i64> loc(#loc59)
      %27 = "top.Weight"() : () -> tensor<1x128x9x64xsi8, 1099520871376 : i64> loc(#loc60)
      %28 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099514011408 : i64> loc(#loc61)
      %29 = "top.Weight"() : () -> tensor<1x128x1x9xi8, 1099518006560 : i64> loc(#loc62)
      %30 = "top.Weight"() : () -> tensor<1x128x1x128xsi8, 1099521343456 : i64> loc(#loc63)
      %31 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099518049760 : i64> loc(#loc64)
      %32 = "tpu.Group"(%25) ({
        %302 = "tpu.Load"(%27) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 9216, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [64], id = 0, stage = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x9x64xsi8, 1099520871376 : i64>) -> tensor<1x128x9x64xsi8> loc(#loc66)
        %303 = "tpu.Load"(%25) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 8960, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 5, 11, 17, 23, 29, 35, 41, 47, 53, 59, 65, 71, 77, 83, 89, 95, 101, 107, 113, 119, 125, 131, 137, 143, 149, 155], h_slice = [6, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 5], w_idx = [0], w_slice = [160], id = 1, stage = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.12394116614173228>, 0 : i64>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.12394116614173228>> loc(#loc67)
        %304 = "tpu.Load"(%26) {do_bcast = false, ginfo = #tpu.lg<out_addr = 9472, out_size = 144, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 2, stage = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x1x9xi8, 1099516582992 : i64>) -> tensor<1x128x1x9xi8> loc(#loc68)
        %305 = "tpu.Load"(%28) {do_bcast = true, ginfo = #tpu.lg<out_addr = 32512, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 3, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099514011408 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc69)
        %306 = "tpu.Conv2D"(%303, %302, %304) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 3840, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78], h_slice = [3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 2], w_idx = [0], w_slice = [80], id = 4, stage = 1, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, strides = [2, 2], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.12394116614173228>>, tensor<1x128x9x64xsi8>, tensor<1x128x1x9xi8>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.08196778897637795>> loc(#loc70)
        %307 = "tpu.Load"(%30) {do_bcast = false, ginfo = #tpu.lg<out_addr = 21248, out_size = 2048, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [128], id = 5, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x1x128xsi8, 1099521343456 : i64>) -> tensor<1x128x1x128xsi8> loc(#loc71)
        %308 = "tpu.Load"(%29) {do_bcast = false, ginfo = #tpu.lg<out_addr = 9616, out_size = 144, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 6, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x1x9xi8, 1099518006560 : i64>) -> tensor<1x128x1x9xi8> loc(#loc72)
        %309 = "tpu.Lut"(%306, %305) {ginfo = #tpu.lg<out_addr = 12288, out_size = 3840, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78], h_slice = [3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 2], w_idx = [0], w_slice = [80], id = 7, stage = 1, group_type = 0>} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.08196778897637795>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.066642506299212589>> loc(#loc73)
        %310 = "tpu.Load"(%31) {do_bcast = true, ginfo = #tpu.lg<out_addr = 9216, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 8, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099518049760 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc74)
        %311 = "tpu.Conv2D"(%309, %307, %308) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 3840, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78], h_slice = [3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 2], w_idx = [0], w_slice = [80], id = 9, stage = 1, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.066642506299212589>>, tensor<1x128x1x128xsi8>, tensor<1x128x1x9xi8>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.096222118897637792>> loc(#loc75)
        %312 = "tpu.Lut"(%311, %310) {ginfo = #tpu.lg<out_addr = 28672, out_size = 3840, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78], h_slice = [3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 2], w_idx = [0], w_slice = [80], id = 10, stage = 1, group_type = 0>} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.096222118897637792>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.066550658267716542>> loc(#loc65)
        %313 = "tpu.Store"(%312) {ginfo = #tpu.lg<out_addr = 28672, out_size = 3840, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78], h_slice = [3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 2], w_idx = [0], w_slice = [80], id = 11, stage = 2, group_type = 0>, support_compress = true} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.066550658267716542>>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.066550658267716542>, 2867200 : i64> loc(#loc65)
        "tpu.Yield"(%313) : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.066550658267716542>, 2867200 : i64>) -> () loc(#loc65)
      }) {csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 3, 11, -2, 7, 5, 6, -3, 9, 8, 0, -4, 10, 1, 2], group_type = 0 : i64, hsecs = 27 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], self_down_overlap_op = [], self_up_overlap_op = [2], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.12394116614173228>, 0 : i64>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.066550658267716542>, 2867200 : i64> loc(#loc65)
      %33 = "tpu.Slice"(%32, %0, %0, %0, %0) {axes = [], ends = [-1, 64, -1, -1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.066550658267716542>, 2867200 : i64>, none, none, none, none) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.066550658267716542>, 2867200 : i64> loc(#loc76)
      %34 = "tpu.Slice"(%32, %0, %0, %0, %0) {axes = [], ends = [-1, 128, -1, -1], offset = [0, 64, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.066550658267716542>, 2867200 : i64>, none, none, none, none) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.066550658267716542>, 3276800 : i64> loc(#loc77)
      %35 = "top.Weight"() {do_compress = true} : () -> tensor<1x64x1x9xi8, 1099518052576 : i64> loc(#loc78)
      %36 = "top.Weight"() {do_compress = true} : () -> tensor<1x64x9x64xsi8, 1099522535216 : i64> loc(#loc79)
      %37 = "tpu.Conv2D"(%34, %36, %35) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.066550658267716542>, 3276800 : i64>, tensor<1x64x9x64xsi8, 1099522535216 : i64>, tensor<1x64x1x9xi8, 1099518052576 : i64>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.084716969291338581>, 409600 : i64> loc(#loc80)
      %38 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099521925920 : i64> loc(#loc81)
      %39 = "top.Weight"() : () -> tensor<1x64x1x9xi8, 1099518049184 : i64> loc(#loc82)
      %40 = "top.Weight"() : () -> tensor<1x64x9x64xsi8, 1099515721680 : i64> loc(#loc83)
      %41 = "tpu.Group"(%37) ({
        %302 = "tpu.Load"(%37) {do_bcast = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 7680, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 9, 19, 29, 39, 49, 59, 69], h_slice = [11, 12, 12, 12, 12, 12, 12, 11], w_idx = [0], w_slice = [80], id = 0, stage = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.084716969291338581>, 409600 : i64>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.084716969291338581>> loc(#loc85)
        %303 = "tpu.Load"(%38) {do_bcast = true, ginfo = #tpu.lg<out_addr = 7680, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 1, stage = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099521925920 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc86)
        %304 = "tpu.Load"(%40) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 4608, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [64], id = 2, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x9x64xsi8, 1099515721680 : i64>) -> tensor<1x64x9x64xsi8> loc(#loc87)
        %305 = "tpu.Load"(%39) {do_bcast = false, ginfo = #tpu.lg<out_addr = 7936, out_size = 72, buffer_addr = 0, buffer_size = 0, eu_align = false, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 3, stage = 1, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x9xi8, 1099518049184 : i64>) -> tensor<1x64x1x9xi8> loc(#loc88)
        %306 = "tpu.Lut"(%302, %303) {ginfo = #tpu.lg<out_addr = 0, out_size = 7680, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 9, 19, 29, 39, 49, 59, 69], h_slice = [11, 12, 12, 12, 12, 12, 12, 11], w_idx = [0], w_slice = [80], id = 4, stage = 1, group_type = 0>} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.084716969291338581>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.046328659842519687>> loc(#loc89)
        %307 = "tpu.Conv2D"(%306, %304, %305) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 6400, buffer_addr = 0, buffer_size = 0, eu_align = true, n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 10, 20, 30, 40, 50, 60, 70], h_slice = [10, 10, 10, 10, 10, 10, 10, 10], w_idx = [0], w_slice = [80], id = 5, stage = 1, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.046328659842519687>>, tensor<1x64x9x64xsi8>, tensor<1x64x1x9xi8>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.065331917322834651>> loc(#loc84)
