ir_version: 10
producer_name: "onnx.quantize"
producer_version: "0.1.0"
graph {
  node {
    input: "images"
    output: "images_quantized"
    output: "images_scale"
    output: "images_zero_point"
    name: "images_QuantizeLinear"
    op_type: "DynamicQuantizeLinear"
  }
  node {
    input: "model.0.conv.bias"
    input: "/model.0/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.0/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.1.conv.bias"
    input: "/model.1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.12.cv1.conv.bias"
    input: "/model.12/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.12/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.12.cv2.conv.bias"
    input: "/model.12/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.12/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.12.m.0.cv1.conv.bias"
    input: "/model.12/m.0/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.12/m.0/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.12.m.0.cv2.conv.bias"
    input: "/model.12/m.0/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.12/m.0/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.15.cv1.conv.bias"
    input: "/model.15/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.15/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.15.cv2.conv.bias"
    input: "/model.15/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.15/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.15.m.0.cv1.conv.bias"
    input: "/model.15/m.0/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.15/m.0/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.15.m.0.cv2.conv.bias"
    input: "/model.15/m.0/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.15/m.0/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.16.conv.bias"
    input: "/model.16/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.16/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.18.cv1.conv.bias"
    input: "/model.18/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.18/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.18.cv2.conv.bias"
    input: "/model.18/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.18/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.18.m.0.cv1.conv.bias"
    input: "/model.18/m.0/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.18/m.0/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.18.m.0.cv2.conv.bias"
    input: "/model.18/m.0/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.18/m.0/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.19.conv.bias"
    input: "/model.19/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.19/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.2.cv1.conv.bias"
    input: "/model.2/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.2/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.2.cv2.conv.bias"
    input: "/model.2/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.2/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.2.m.0.cv1.conv.bias"
    input: "/model.2/m.0/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.2/m.0/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.2.m.0.cv2.conv.bias"
    input: "/model.2/m.0/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.2/m.0/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.21.cv1.conv.bias"
    input: "/model.21/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.21/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.21.cv2.conv.bias"
    input: "/model.21/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.21/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.21.m.0.cv1.conv.bias"
    input: "/model.21/m.0/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.21/m.0/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.21.m.0.cv2.conv.bias"
    input: "/model.21/m.0/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.21/m.0/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv2.0.0.conv.bias"
    input: "/model.22/cv2.0/cv2.0.0/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv2.0/cv2.0.0/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv2.0.1.conv.bias"
    input: "/model.22/cv2.0/cv2.0.1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv2.0/cv2.0.1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv2.0.2.bias"
    input: "/model.22/cv2.0/cv2.0.2/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv2.0/cv2.0.2/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv2.1.0.conv.bias"
    input: "/model.22/cv2.1/cv2.1.0/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv2.1/cv2.1.0/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv2.1.1.conv.bias"
    input: "/model.22/cv2.1/cv2.1.1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv2.1/cv2.1.1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv2.1.2.bias"
    input: "/model.22/cv2.1/cv2.1.2/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv2.1/cv2.1.2/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv2.2.0.conv.bias"
    input: "/model.22/cv2.2/cv2.2.0/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv2.2/cv2.2.0/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv2.2.1.conv.bias"
    input: "/model.22/cv2.2/cv2.2.1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv2.2/cv2.2.1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv2.2.2.bias"
    input: "/model.22/cv2.2/cv2.2.2/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv2.2/cv2.2.2/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv3.0.0.conv.bias"
    input: "/model.22/cv3.0/cv3.0.0/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv3.0/cv3.0.0/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv3.0.1.conv.bias"
    input: "/model.22/cv3.0/cv3.0.1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv3.0/cv3.0.1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv3.0.2.bias"
    input: "/model.22/cv3.0/cv3.0.2/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv3.0/cv3.0.2/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv3.1.0.conv.bias"
    input: "/model.22/cv3.1/cv3.1.0/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv3.1/cv3.1.0/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv3.1.1.conv.bias"
    input: "/model.22/cv3.1/cv3.1.1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv3.1/cv3.1.1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv3.1.2.bias"
    input: "/model.22/cv3.1/cv3.1.2/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv3.1/cv3.1.2/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv3.2.0.conv.bias"
    input: "/model.22/cv3.2/cv3.2.0/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv3.2/cv3.2.0/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv3.2.1.conv.bias"
    input: "/model.22/cv3.2/cv3.2.1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv3.2/cv3.2.1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.22.cv3.2.2.bias"
    input: "/model.22/cv3.2/cv3.2.2/Conv_output_0_bias_reshape_shape"
    output: "/model.22/cv3.2/cv3.2.2/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.3.conv.bias"
    input: "/model.3/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.3/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.4.cv1.conv.bias"
    input: "/model.4/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.4/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.4.cv2.conv.bias"
    input: "/model.4/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.4/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.4.m.0.cv1.conv.bias"
    input: "/model.4/m.0/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.4/m.0/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.4.m.0.cv2.conv.bias"
    input: "/model.4/m.0/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.4/m.0/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.4.m.1.cv1.conv.bias"
    input: "/model.4/m.1/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.4/m.1/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.4.m.1.cv2.conv.bias"
    input: "/model.4/m.1/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.4/m.1/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.5.conv.bias"
    input: "/model.5/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.5/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.6.cv1.conv.bias"
    input: "/model.6/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.6/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.6.cv2.conv.bias"
    input: "/model.6/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.6/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.6.m.0.cv1.conv.bias"
    input: "/model.6/m.0/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.6/m.0/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.6.m.0.cv2.conv.bias"
    input: "/model.6/m.0/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.6/m.0/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.6.m.1.cv1.conv.bias"
    input: "/model.6/m.1/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.6/m.1/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.6.m.1.cv2.conv.bias"
    input: "/model.6/m.1/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.6/m.1/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.7.conv.bias"
    input: "/model.7/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.7/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.8.cv1.conv.bias"
    input: "/model.8/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.8/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.8.cv2.conv.bias"
    input: "/model.8/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.8/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.8.m.0.cv1.conv.bias"
    input: "/model.8/m.0/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.8/m.0/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.8.m.0.cv2.conv.bias"
    input: "/model.8/m.0/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.8/m.0/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.9.cv1.conv.bias"
    input: "/model.9/cv1/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.9/cv1/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "model.9.cv2.conv.bias"
    input: "/model.9/cv2/conv/Conv_output_0_bias_reshape_shape"
    output: "/model.9/cv2/conv/Conv_output_0_bias_reshape_output"
    op_type: "Reshape"
  }
  node {
    input: "images_scale"
    input: "model.0.conv.weight_scale"
    output: "/model.0/conv/Conv_quant_scales_mul:0"
    name: "/model.0/conv/Conv_quant_scales_mul"
    op_type: "Mul"
  }
  node {
    input: "images_quantized"
    input: "model.0.conv.weight_quantized"
    input: "images_zero_point"
    input: "model.0.conv.weight_zero_point"
    output: "/model.0/conv/Conv_output_0_output_quantized"
    name: "/model.0/conv/Conv_quant"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/model.0/conv/Conv_output_0_output_quantized"
    output: "/model.0/conv/Conv_output_0_output_quantized_cast_output"
    name: "/model.0/conv/Conv_output_0_output_quantized_cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.0/conv/Conv_output_0_output_quantized_cast_output"
    input: "/model.0/conv/Conv_quant_scales_mul:0"
    output: "/model.0/conv/Conv_output_0quant_scaled_output"
    name: "/model.0/conv/Conv_quant_output_scale_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.0/conv/Conv_output_0quant_scaled_output"
    input: "/model.0/conv/Conv_output_0_bias_reshape_output"
    output: "/model.0/conv/Conv_output_0"
    name: "/model.0/conv/Conv_output_0_bias_add"
    op_type: "Add"
  }
  node {
    input: "/model.0/conv/Conv_output_0"
    output: "/model.0/act/Sigmoid_output_0"
    name: "/model.0/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.0/conv/Conv_output_0"
    input: "/model.0/act/Sigmoid_output_0"
    output: "/model.0/act/Mul_output_0"
    name: "/model.0/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.0/act/Mul_output_0"
    output: "/model.0/act/Mul_output_0_quantized"
    output: "/model.0/act/Mul_output_0_scale"
    output: "/model.0/act/Mul_output_0_zero_point"
    name: "/model.0/act/Mul_output_0_QuantizeLinear"
    op_type: "DynamicQuantizeLinear"
  }
  node {
    input: "/model.0/act/Mul_output_0_scale"
    input: "model.1.conv.weight_scale"
    output: "/model.1/conv/Conv_quant_scales_mul:0"
    name: "/model.1/conv/Conv_quant_scales_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.0/act/Mul_output_0_quantized"
    input: "model.1.conv.weight_quantized"
    input: "/model.0/act/Mul_output_0_zero_point"
    input: "model.1.conv.weight_zero_point"
    output: "/model.1/conv/Conv_output_0_output_quantized"
    name: "/model.1/conv/Conv_quant"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/model.1/conv/Conv_output_0_output_quantized"
    output: "/model.1/conv/Conv_output_0_output_quantized_cast_output"
    name: "/model.1/conv/Conv_output_0_output_quantized_cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.1/conv/Conv_output_0_output_quantized_cast_output"
    input: "/model.1/conv/Conv_quant_scales_mul:0"
    output: "/model.1/conv/Conv_output_0quant_scaled_output"
    name: "/model.1/conv/Conv_quant_output_scale_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.1/conv/Conv_output_0quant_scaled_output"
    input: "/model.1/conv/Conv_output_0_bias_reshape_output"
    output: "/model.1/conv/Conv_output_0"
    name: "/model.1/conv/Conv_output_0_bias_add"
    op_type: "Add"
  }
  node {
    input: "/model.1/conv/Conv_output_0"
    output: "/model.1/act/Sigmoid_output_0"
    name: "/model.1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.1/conv/Conv_output_0"
    input: "/model.1/act/Sigmoid_output_0"
    output: "/model.1/act/Mul_output_0"
    name: "/model.1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.1/act/Mul_output_0"
    output: "/model.1/act/Mul_output_0_quantized"
    output: "/model.1/act/Mul_output_0_scale"
    output: "/model.1/act/Mul_output_0_zero_point"
    name: "/model.1/act/Mul_output_0_QuantizeLinear"
    op_type: "DynamicQuantizeLinear"
  }
  node {
    input: "/model.1/act/Mul_output_0_scale"
    input: "model.2.cv1.conv.weight_scale"
    output: "/model.2/cv1/conv/Conv_quant_scales_mul:0"
    name: "/model.2/cv1/conv/Conv_quant_scales_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.1/act/Mul_output_0_quantized"
    input: "model.2.cv1.conv.weight_quantized"
    input: "/model.1/act/Mul_output_0_zero_point"
    input: "model.2.cv1.conv.weight_zero_point"
    output: "/model.2/cv1/conv/Conv_output_0_output_quantized"
    name: "/model.2/cv1/conv/Conv_quant"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.2/cv1/conv/Conv_output_0_output_quantized"
    output: "/model.2/cv1/conv/Conv_output_0_output_quantized_cast_output"
    name: "/model.2/cv1/conv/Conv_output_0_output_quantized_cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.2/cv1/conv/Conv_output_0_output_quantized_cast_output"
    input: "/model.2/cv1/conv/Conv_quant_scales_mul:0"
    output: "/model.2/cv1/conv/Conv_output_0quant_scaled_output"
    name: "/model.2/cv1/conv/Conv_quant_output_scale_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/cv1/conv/Conv_output_0quant_scaled_output"
    input: "/model.2/cv1/conv/Conv_output_0_bias_reshape_output"
    output: "/model.2/cv1/conv/Conv_output_0"
    name: "/model.2/cv1/conv/Conv_output_0_bias_add"
    op_type: "Add"
  }
  node {
    input: "/model.2/cv1/conv/Conv_output_0"
    output: "/model.2/cv1/act/Sigmoid_output_0"
    name: "/model.2/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.2/cv1/conv/Conv_output_0"
    input: "/model.2/cv1/act/Sigmoid_output_0"
    output: "/model.2/cv1/act/Mul_output_0"
    name: "/model.2/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/cv1/act/Mul_output_0"
    input: "onnx::Split_137"
    output: "/model.2/Split_output_0"
    output: "/model.2/Split_output_1"
    name: "/model.2/Split"
    op_type: "Split"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.2/Split_output_1"
    output: "/model.2/Split_output_1_quantized"
    output: "/model.2/Split_output_1_scale"
    output: "/model.2/Split_output_1_zero_point"
    name: "/model.2/Split_output_1_QuantizeLinear"
    op_type: "DynamicQuantizeLinear"
  }
  node {
    input: "/model.2/Split_output_1_scale"
    input: "model.2.m.0.cv1.conv.weight_scale"
    output: "/model.2/m.0/cv1/conv/Conv_quant_scales_mul:0"
    name: "/model.2/m.0/cv1/conv/Conv_quant_scales_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/Split_output_1_quantized"
    input: "model.2.m.0.cv1.conv.weight_quantized"
    input: "/model.2/Split_output_1_zero_point"
    input: "model.2.m.0.cv1.conv.weight_zero_point"
    output: "/model.2/m.0/cv1/conv/Conv_output_0_output_quantized"
    name: "/model.2/m.0/cv1/conv/Conv_quant"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.2/m.0/cv1/conv/Conv_output_0_output_quantized"
    output: "/model.2/m.0/cv1/conv/Conv_output_0_output_quantized_cast_output"
    name: "/model.2/m.0/cv1/conv/Conv_output_0_output_quantized_cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.2/m.0/cv1/conv/Conv_output_0_output_quantized_cast_output"
    input: "/model.2/m.0/cv1/conv/Conv_quant_scales_mul:0"
    output: "/model.2/m.0/cv1/conv/Conv_output_0quant_scaled_output"
    name: "/model.2/m.0/cv1/conv/Conv_quant_output_scale_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/m.0/cv1/conv/Conv_output_0quant_scaled_output"
    input: "/model.2/m.0/cv1/conv/Conv_output_0_bias_reshape_output"
    output: "/model.2/m.0/cv1/conv/Conv_output_0"
    name: "/model.2/m.0/cv1/conv/Conv_output_0_bias_add"
    op_type: "Add"
  }
  node {
    input: "/model.2/m.0/cv1/conv/Conv_output_0"
    output: "/model.2/m.0/cv1/act/Sigmoid_output_0"
    name: "/model.2/m.0/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.2/m.0/cv1/conv/Conv_output_0"
    input: "/model.2/m.0/cv1/act/Sigmoid_output_0"
    output: "/model.2/m.0/cv1/act/Mul_output_0"
    name: "/model.2/m.0/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/m.0/cv1/act/Mul_output_0"
    output: "/model.2/m.0/cv1/act/Mul_output_0_quantized"
    output: "/model.2/m.0/cv1/act/Mul_output_0_scale"
    output: "/model.2/m.0/cv1/act/Mul_output_0_zero_point"
    name: "/model.2/m.0/cv1/act/Mul_output_0_QuantizeLinear"
    op_type: "DynamicQuantizeLinear"
  }
  node {
    input: "/model.2/m.0/cv1/act/Mul_output_0_scale"
    input: "model.2.m.0.cv2.conv.weight_scale"
    output: "/model.2/m.0/cv2/conv/Conv_quant_scales_mul:0"
    name: "/model.2/m.0/cv2/conv/Conv_quant_scales_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/m.0/cv1/act/Mul_output_0_quantized"
    input: "model.2.m.0.cv2.conv.weight_quantized"
    input: "/model.2/m.0/cv1/act/Mul_output_0_zero_point"
    input: "model.2.m.0.cv2.conv.weight_zero_point"
    output: "/model.2/m.0/cv2/conv/Conv_output_0_output_quantized"
    name: "/model.2/m.0/cv2/conv/Conv_quant"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.2/m.0/cv2/conv/Conv_output_0_output_quantized"
    output: "/model.2/m.0/cv2/conv/Conv_output_0_output_quantized_cast_output"
    name: "/model.2/m.0/cv2/conv/Conv_output_0_output_quantized_cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.2/m.0/cv2/conv/Conv_output_0_output_quantized_cast_output"
    input: "/model.2/m.0/cv2/conv/Conv_quant_scales_mul:0"
    output: "/model.2/m.0/cv2/conv/Conv_output_0quant_scaled_output"
    name: "/model.2/m.0/cv2/conv/Conv_quant_output_scale_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/m.0/cv2/conv/Conv_output_0quant_scaled_output"
    input: "/model.2/m.0/cv2/conv/Conv_output_0_bias_reshape_output"
    output: "/model.2/m.0/cv2/conv/Conv_output_0"
    name: "/model.2/m.0/cv2/conv/Conv_output_0_bias_add"
    op_type: "Add"
  }
  node {
    input: "/model.2/m.0/cv2/conv/Conv_output_0"
    output: "/model.2/m.0/cv2/act/Sigmoid_output_0"
    name: "/model.2/m.0/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.2/m.0/cv2/conv/Conv_output_0"
    input: "/model.2/m.0/cv2/act/Sigmoid_output_0"
    output: "/model.2/m.0/cv2/act/Mul_output_0"
    name: "/model.2/m.0/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/Split_output_1"
    input: "/model.2/m.0/cv2/act/Mul_output_0"
    output: "/model.2/m.0/Add_output_0"
    name: "/model.2/m.0/Add"
    op_type: "Add"
  }
  node {
    input: "/model.2/Split_output_0"
    input: "/model.2/Split_output_1"
    input: "/model.2/m.0/Add_output_0"
    output: "/model.2/Concat_output_0"
    name: "/model.2/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.2/Concat_output_0"
    output: "/model.2/Concat_output_0_quantized"
    output: "/model.2/Concat_output_0_scale"
    output: "/model.2/Concat_output_0_zero_point"
    name: "/model.2/Concat_output_0_QuantizeLinear"
    op_type: "DynamicQuantizeLinear"
  }
  node {
    input: "/model.2/Concat_output_0_scale"
    input: "model.2.cv2.conv.weight_scale"
    output: "/model.2/cv2/conv/Conv_quant_scales_mul:0"
    name: "/model.2/cv2/conv/Conv_quant_scales_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/Concat_output_0_quantized"
    input: "model.2.cv2.conv.weight_quantized"
    input: "/model.2/Concat_output_0_zero_point"
    input: "model.2.cv2.conv.weight_zero_point"
    output: "/model.2/cv2/conv/Conv_output_0_output_quantized"
    name: "/model.2/cv2/conv/Conv_quant"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.2/cv2/conv/Conv_output_0_output_quantized"
    output: "/model.2/cv2/conv/Conv_output_0_output_quantized_cast_output"
    name: "/model.2/cv2/conv/Conv_output_0_output_quantized_cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.2/cv2/conv/Conv_output_0_output_quantized_cast_output"
    input: "/model.2/cv2/conv/Conv_quant_scales_mul:0"
    output: "/model.2/cv2/conv/Conv_output_0quant_scaled_output"
    name: "/model.2/cv2/conv/Conv_quant_output_scale_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/cv2/conv/Conv_output_0quant_scaled_output"
    input: "/model.2/cv2/conv/Conv_output_0_bias_reshape_output"
    output: "/model.2/cv2/conv/Conv_output_0"
    name: "/model.2/cv2/conv/Conv_output_0_bias_add"
    op_type: "Add"
  }
  node {
    input: "/model.2/cv2/conv/Conv_output_0"
    output: "/model.2/cv2/act/Sigmoid_output_0"
    name: "/model.2/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.2/cv2/conv/Conv_output_0"
    input: "/model.2/cv2/act/Sigmoid_output_0"
    output: "/model.2/cv2/act/Mul_output_0"
    name: "/model.2/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/cv2/act/Mul_output_0"
    output: "/model.2/cv2/act/Mul_output_0_quantized"
    output: "/model.2/cv2/act/Mul_output_0_scale"
    output: "/model.2/cv2/act/Mul_output_0_zero_point"
    name: "/model.2/cv2/act/Mul_output_0_QuantizeLinear"
    op_type: "DynamicQuantizeLinear"
  }
  node {
    input: "/model.2/cv2/act/Mul_output_0_scale"
    input: "model.3.conv.weight_scale"
    output: "/model.3/conv/Conv_quant_scales_mul:0"
    name: "/model.3/conv/Conv_quant_scales_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/cv2/act/Mul_output_0_quantized"
    input: "model.3.conv.weight_quantized"
    input: "/model.2/cv2/act/Mul_output_0_zero_point"
    input: "model.3.conv.weight_zero_point"
    output: "/model.3/conv/Conv_output_0_output_quantized"
    name: "/model.3/conv/Conv_quant"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/model.3/conv/Conv_output_0_output_quantized"
    output: "/model.3/conv/Conv_output_0_output_quantized_cast_output"
    name: "/model.3/conv/Conv_output_0_output_quantized_cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.3/conv/Conv_output_0_output_quantized_cast_output"
    input: "/model.3/conv/Conv_quant_scales_mul:0"
    output: "/model.3/conv/Conv_output_0quant_scaled_output"
    name: "/model.3/conv/Conv_quant_output_scale_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.3/conv/Conv_output_0quant_scaled_output"
    input: "/model.3/conv/Conv_output_0_bias_reshape_output"
    output: "/model.3/conv/Conv_output_0"
    name: "/model.3/conv/Conv_output_0_bias_add"
    op_type: "Add"
  }
  node {
    input: "/model.3/conv/Conv_output_0"
    output: "/model.3/act/Sigmoid_output_0"
    name: "/model.3/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.3/conv/Conv_output_0"
    input: "/model.3/act/Sigmoid_output_0"
    output: "/model.3/act/Mul_output_0"
    name: "/model.3/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.3/act/Mul_output_0"
    output: "/model.3/act/Mul_output_0_quantized"
    output: "/model.3/act/Mul_output_0_scale"
    output: "/model.3/act/Mul_output_0_zero_point"
    name: "/model.3/act/Mul_output_0_QuantizeLinear"
    op_type: "DynamicQuantizeLinear"
  }
  node {
    input: "/model.3/act/Mul_output_0_scale"
    input: "model.4.cv1.conv.weight_scale"
    output: "/model.4/cv1/conv/Conv_quant_scales_mul:0"
    name: "/model.4/cv1/conv/Conv_quant_scales_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.3/act/Mul_output_0_quantized"
    input: "model.4.cv1.conv.weight_quantized"
    input: "/model.3/act/Mul_output_0_zero_point"
    input: "model.4.cv1.conv.weight_zero_point"
    output: "/model.4/cv1/conv/Conv_output_0_output_quantized"
    name: "/model.4/cv1/conv/Conv_quant"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.4/cv1/conv/Conv_output_0_output_quantized"
    output: "/model.4/cv1/conv/Conv_output_0_output_quantized_cast_output"
    name: "/model.4/cv1/conv/Conv_output_0_output_quantized_cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.4/cv1/conv/Conv_output_0_output_quantized_cast_output"
    input: "/model.4/cv1/conv/Conv_quant_scales_mul:0"
    output: "/model.4/cv1/conv/Conv_output_0quant_scaled_output"
    name: "/model.4/cv1/conv/Conv_quant_output_scale_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/cv1/conv/Conv_output_0quant_scaled_output"
    input: "/model.4/cv1/conv/Conv_output_0_bias_reshape_output"
    output: "/model.4/cv1/conv/Conv_output_0"
    name: "/model.4/cv1/conv/Conv_output_0_bias_add"
    op_type: "Add"
  }
  node {
    input: "/model.4/cv1/conv/Conv_output_0"
    output: "/model.4/cv1/act/Sigmoid_output_0"
    name: "/model.4/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.4/cv1/conv/Conv_output_0"
    input: "/model.4/cv1/act/Sigmoid_output_0"
    output: "/model.4/cv1/act/Mul_output_0"
    name: "/model.4/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/cv1/act/Mul_output_0"
    input: "onnx::Split_157"
    output: "/model.4/Split_output_0"
    output: "/model.4/Split_output_1"
    name: "/model.4/Split"
    op_type: "Split"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.4/Split_output_1"
    output: "/model.4/Split_output_1_quantized"
    output: "/model.4/Split_output_1_scale"
    output: "/model.4/Split_output_1_zero_point"
    name: "/model.4/Split_output_1_QuantizeLinear"
    op_type: "DynamicQuantizeLinear"
  }
  node {
    input: "/model.4/Split_output_1_scale"
    input: "model.4.m.0.cv1.conv.weight_scale"
    output: "/model.4/m.0/cv1/conv/Conv_quant_scales_mul:0"
    name: "/model.4/m.0/cv1/conv/Conv_quant_scales_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/Split_output_1_quantized"
    input: "model.4.m.0.cv1.conv.weight_quantized"
    input: "/model.4/Split_output_1_zero_point"
    input: "model.4.m.0.cv1.conv.weight_zero_point"
    output: "/model.4/m.0/cv1/conv/Conv_output_0_output_quantized"
    name: "/model.4/m.0/cv1/conv/Conv_quant"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.4/m.0/cv1/conv/Conv_output_0_output_quantized"
    output: "/model.4/m.0/cv1/conv/Conv_output_0_output_quantized_cast_output"
    name: "/model.4/m.0/cv1/conv/Conv_output_0_output_quantized_cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.4/m.0/cv1/conv/Conv_output_0_output_quantized_cast_output"
    input: "/model.4/m.0/cv1/conv/Conv_quant_scales_mul:0"
    output: "/model.4/m.0/cv1/conv/Conv_output_0quant_scaled_output"
    name: "/model.4/m.0/cv1/conv/Conv_quant_output_scale_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/m.0/cv1/conv/Conv_output_0quant_scaled_output"
    input: "/model.4/m.0/cv1/conv/Conv_output_0_bias_reshape_output"
    output: "/model.4/m.0/cv1/conv/Conv_output_0"
    name: "/model.4/m.0/cv1/conv/Conv_output_0_bias_add"
    op_type: "Add"
  }
  node {
    input: "/model.4/m.0/cv1/conv/Conv_output_0"
    output: "/model.4/m.0/cv1/act/Sigmoid_output_0"
    name: "/model.4/m.0/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.4/m.0/cv1/conv/Conv_output_0"
    input: "/model.4/m.0/cv1/act/Sigmoid_output_0"
    output: "/model.4/m.0/cv1/act/Mul_output_0"
    name: "/model.4/m.0/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/m.0/cv1/act/Mul_output_0"
    output: "/model.4/m.0/cv1/act/Mul_output_0_quantized"
    output: "/model.4/m.0/cv1/act/Mul_output_0_scale"
    output: "/model.4/m.0/cv1/act/Mul_output_0_zero_point"
    name: "/model.4/m.0/cv1/act/Mul_output_0_QuantizeLinear"
    op_type: "DynamicQuantizeLinear"
  }
  node {
    input: "/model.4/m.0/cv1/act/Mul_output_0_scale"
    input: "model.4.m.0.cv2.conv.weight_scale"
    output: "/model.4/m.0/cv2/conv/Conv_quant_scales_mul:0"
    name: "/model.4/m.0/cv2/conv/Conv_quant_scales_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/m.0/cv1/act/Mul_output_0_quantized"
    input: "model.4.m.0.cv2.conv.weight_quantized"
    input: "/model.4/m.0/cv1/act/Mul_output_0_zero_point"
    input: "model.4.m.0.cv2.conv.weight_zero_point"
    output: "/model.4/m.0/cv2/conv/Conv_output_0_output_quantized"
    name: "/model.4/m.0/cv2/conv/Conv_quant"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.4/m.0/cv2/conv/Conv_output_0_output_quantized"
    output: "/model.4/m.0/cv2/conv/Conv_output_0_output_quantized_cast_output"
    name: "/model.4/m.0/cv2/conv/Conv_output_0_output_quantized_cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.4/m.0/cv2/conv/Conv_output_0_output_quantized_cast_output"
    input: "/model.4/m.0/cv2/conv/Conv_quant_scales_mul:0"
    output: "/model.4/m.0/cv2/conv/Conv_output_0quant_scaled_output"
    name: "/model.4/m.0/cv2/conv/Conv_quant_output_scale_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/m.0/cv2/conv/Conv_output_0quant_scaled_output"
    input: "/model.4/m.0/cv2/conv/Conv_output_0_bias_reshape_output"
    output: "/model.4/m.0/cv2/conv/Conv_output_0"
    name: "/model.4/m.0/cv2/conv/Conv_output_0_bias_add"
    op_type: "Add"
  }
  node {
    input: "/model.4/m.0/cv2/conv/Conv_output_0"
    output: "/model.4/m.0/cv2/act/Sigmoid_output_0"
    name: "/model.4/m.0/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.4/m.0/cv2/conv/Conv_output_0"
    input: "/model.4/m.0/cv2/act/Sigmoid_output_0"
    output: "/model.4/m.0/cv2/act/Mul_output_0"
    name: "/model.4/m.0/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/Split_output_1"
    input: "/model.4/m.0/cv2/act/Mul_output_0"
    output: "/model.4/m.0/Add_output_0"
    name: "/model.4/m.0/Add"
    op_type: "Add"
  }
  node {
    input: "/model.4/m.0/Add_output_0"
    output: "/model.4/m.0/Add_output_0_quantized"
    output: "/model.4/m.0/Add_output_0_scale"
    output: "/model.4/m.0/Add_output_0_zero_point"
    name: "/model.4/m.0/Add_output_0_QuantizeLinear"
    op_type: "DynamicQuantizeLinear"
  }
  node {
    input: "/model.4/m.0/Add_output_0_scale"
    input: "model.4.m.1.cv1.conv.weight_scale"
    output: "/model.4/m.1/cv1/conv/Conv_quant_scales_mul:0"
    name: "/model.4/m.1/cv1/conv/Conv_quant_scales_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/m.0/Add_output_0_quantized"
    input: "model.4.m.1.cv1.conv.weight_quantized"
    input: "/model.4/m.0/Add_output_0_zero_point"
    input: "model.4.m.1.cv1.conv.weight_zero_point"
    output: "/model.4/m.1/cv1/conv/Conv_output_0_output_quantized"
    name: "/model.4/m.1/cv1/conv/Conv_quant"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.4/m.1/cv1/conv/Conv_output_0_output_quantized"
    output: "/model.4/m.1/cv1/conv/Conv_output_0_output_quantized_cast_output"
    name: "/model.4/m.1/cv1/conv/Conv_output_0_output_quantized_cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.4/m.1/cv1/conv/Conv_output_0_output_quantized_cast_output"
    input: "/model.4/m.1/cv1/conv/Conv_quant_scales_mul:0"
    output: "/model.4/m.1/cv1/conv/Conv_output_0quant_scaled_output"
    name: "/model.4/m.1/cv1/conv/Conv_quant_output_scale_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/m.1/cv1/conv/Conv_output_0quant_scaled_output"
    input: "/model.4/m.1/cv1/conv/Conv_output_0_bias_reshape_output"
    output: "/model.4/m.1/cv1/conv/Conv_output_0"
    name: "/model.4/m.1/cv1/conv/Conv_output_0_bias_add"
    op_type: "Add"
  }
  node {
    input: "/model.4/m.1/cv1/conv/Conv_output_0"
    output: "/model.4/m.1/cv1/act/Sigmoid_output_0"
    name: "/model.4/m.1/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.4/m.1/cv1/conv/Conv_output_0"
    input: "/model.4/m.1/cv1/act/Sigmoid_output_0"
    output: "/model.4/m.1/cv1/act/Mul_output_0"
    name: "/model.4/m.1/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/m.1/cv1/act/Mul_output_0"
    output: "/model.4/m.1/cv1/act/Mul_output_0_quantized"
    output: "/model.4/m.1/cv1/act/Mul_output_0_scale"
    output: "/model.4/m.1/cv1/act/Mul_output_0_zero_point"
    name: "/model.4/m.1/cv1/act/Mul_output_0_QuantizeLinear"
    op_type: "DynamicQuantizeLinear"
  }
  node {
    input: "/model.4/m.1/cv1/act/Mul_output_0_scale"
    input: "model.4.m.1.cv2.conv.weight_scale"
    output: "/model.4/m.1/cv2/conv/Conv_quant_scales_mul:0"
    name: "/model.4/m.1/cv2/conv/Conv_quant_scales_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/m.1/cv1/act/Mul_output_0_quantized"
    input: "model.4.m.1.cv2.conv.weight_quantized"
    input: "/model.4/m.1/cv1/act/Mul_output_0_zero_point"
    input: "model.4.m.1.cv2.conv.weight_zero_point"
    output: "/model.4/m.1/cv2/conv/Conv_output_0_output_quantized"
    name: "/model.4/m.1/cv2/conv/Conv_quant"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.4/m.1/cv2/conv/Conv_output_0_output_quantized"
    output: "/model.4/m.1/cv2/conv/Conv_output_0_output_quantized_cast_output"
    name: "/model.4/m.1/cv2/conv/Conv_output_0_output_quantized_cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.4/m.1/cv2/conv/Conv_output_0_output_quantized_cast_output"
    input: "/model.4/m.1/cv2/conv/Conv_quant_scales_mul:0"
    output: "/model.4/m.1/cv2/conv/Conv_output_0quant_scaled_output"
    name: "/model.4/m.1/cv2/conv/Conv_quant_output_scale_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/m.1/cv2/conv/Conv_output_0quant_scaled_output"
    input: "/model.4/m.1/cv2/conv/Conv_output_0_bias_reshape_output"
    output: "/model.4/m.1/cv2/conv/Conv_output_0"
    name: "/model.4/m.1/cv2/conv/Conv_output_0_bias_add"
    op_type: "Add"
  }
  node {
    input: "/model.4/m.1/cv2/conv/Conv_output_0"
    output: "/model.4/m.1/cv2/act/Sigmoid_output_0"
    name: "/model.4/m.1/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.4/m.1/cv2/conv/Conv_output_0"
    input: "/model.4/m.1/cv2/act/Sigmoid_output_0"
    output: "/model.4/m.1/cv2/act/Mul_output_0"
    name: "/model.4/m.1/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/m.0/Add_output_0"
    input: "/model.4/m.1/cv2/act/Mul_output_0"
    output: "/model.4/m.1/Add_output_0"
    name: "/model.4/m.1/Add"
    op_type: "Add"
  }
  node {
    input: "/model.4/Split_output_0"
    input: "/model.4/Split_output_1"
    input: "/model.4/m.0/Add_output_0"
    input: "/model.4/m.1/Add_output_0"
    output: "/model.4/Concat_output_0"
    name: "/model.4/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.4/Concat_output_0"
    output: "/model.4/Concat_output_0_quantized"
    output: "/model.4/Concat_output_0_scale"
    output: "/model.4/Concat_output_0_zero_point"
    name: "/model.4/Concat_output_0_QuantizeLinear"
    op_type: "DynamicQuantizeLinear"
  }
  node {
    input: "/model.4/Concat_output_0_scale"
    input: "model.4.cv2.conv.weight_scale"
    output: "/model.4/cv2/conv/Conv_quant_scales_mul:0"
    name: "/model.4/cv2/conv/Conv_quant_scales_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/Concat_output_0_quantized"
    input: "model.4.cv2.conv.weight_quantized"
    input: "/model.4/Concat_output_0_zero_point"
    input: "model.4.cv2.conv.weight_zero_point"
    output: "/model.4/cv2/conv/Conv_output_0_output_quantized"
    name: "/model.4/cv2/conv/Conv_quant"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.4/cv2/conv/Conv_output_0_output_quantized"
    output: "/model.4/cv2/conv/Conv_output_0_output_quantized_cast_output"
    name: "/model.4/cv2/conv/Conv_output_0_output_quantized_cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.4/cv2/conv/Conv_output_0_output_quantized_cast_output"
    input: "/model.4/cv2/conv/Conv_quant_scales_mul:0"
    output: "/model.4/cv2/conv/Conv_output_0quant_scaled_output"
    name: "/model.4/cv2/conv/Conv_quant_output_scale_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/cv2/conv/Conv_output_0quant_scaled_output"
    input: "/model.4/cv2/conv/Conv_output_0_bias_reshape_output"
    output: "/model.4/cv2/conv/Conv_output_0"
    name: "/model.4/cv2/conv/Conv_output_0_bias_add"
    op_type: "Add"
  }
  node {
    input: "/model.4/cv2/conv/Conv_output_0"
    output: "/model.4/cv2/act/Sigmoid_output_0"
    name: "/model.4/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.4/cv2/conv/Conv_output_0"
    input: "/model.4/cv2/act/Sigmoid_output_0"
    output: "/model.4/cv2/act/Mul_output_0"
    name: "/model.4/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/cv2/act/Mul_output_0"
    output: "/model.4/cv2/act/Mul_output_0_quantized"
    output: "/model.4/cv2/act/Mul_output_0_scale"
    output: "/model.4/cv2/act/Mul_output_0_zero_point"
    name: "/model.4/cv2/act/Mul_output_0_QuantizeLinear"
    op_type: "DynamicQuantizeLinear"
  }
  node {
    input: "/model.4/cv2/act/Mul_output_0_scale"
    input: "model.5.conv.weight_scale"
    output: "/model.5/conv/Conv_quant_scales_mul:0"
    name: "/model.5/conv/Conv_quant_scales_mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/cv2/act/Mul_output_0_quantized"
    input: "model.5.conv.weight_quantized"
    input: "/model.4/cv2/act/Mul_output_0_zero_point"
    input: "model.5.conv.weight_zero_point"
    output: "/model.5/conv/Conv_output_0_output_quantized"
    name: "/model.5/conv/Conv_quant"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/model.5/conv/Conv_output_0_output_quantized"
    output: "/model.5/conv/Conv_output_0_output_quantized_cast_output"
    name: "/model.5/conv/Conv_output_0_output_quantized_cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.5/conv/Conv_output_0_output_quantized_cast_output"
    input: "/model.5/conv/Conv_quant_scales_mul:0"
    output: "/model.5/conv/Conv_output_0quant_scaled_output"
    name: "/model.5/conv/Conv_quant_output_scale_mul"
    op_type: "Mul"
  }
  node {
