#loc = loc(unknown)
module @yolov8s attributes {module.chip = "ALL", module.platform = "ONNX", module.state = "TOP_F32", module.weight_file = "yolov8s_top_f32_all_origin_weight.npz"} {
  func.func @main(%arg0: tensor<1x3x640x640xf32> loc(unknown)) -> (tensor<*xf32>, tensor<*xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {black_level = 1.120000e+02 : f64, channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [640, 640], scale = [0.0039215688593685627, 0.0039215688593685627, 0.0039215688593685627], white_level = 4.095000e+03 : f64} : (tensor<1x3x640x640xf32>) -> tensor<1x3x640x640xf32> loc(#loc1)
    %2 = "top.Weight"() : () -> tensor<32x3x3x3xf32> loc(#loc2)
    %3 = "top.Weight"() : () -> tensor<32xf32> loc(#loc3)
    %4 = "top.Conv"(%1, %2, %3) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<1x3x640x640xf32>, tensor<32x3x3x3xf32>, tensor<32xf32>) -> tensor<*xf32> loc(#loc4)
    %5 = "top.Sigmoid"(%4) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc5)
    %6 = "top.Mul"(%4, %5) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc6)
    %7 = "top.Weight"() : () -> tensor<64x32x3x3xf32> loc(#loc7)
    %8 = "top.Weight"() : () -> tensor<64xf32> loc(#loc8)
    %9 = "top.Conv"(%6, %7, %8) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x32x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc9)
    %10 = "top.Sigmoid"(%9) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc10)
    %11 = "top.Mul"(%9, %10) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc11)
    %12 = "top.Weight"() : () -> tensor<64x64x1x1xf32> loc(#loc12)
    %13 = "top.Weight"() : () -> tensor<64xf32> loc(#loc13)
    %14 = "top.Conv"(%11, %12, %13) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x1x1xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc14)
    %15 = "top.Sigmoid"(%14) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc15)
    %16 = "top.Mul"(%14, %15) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc16)
    %17:2 = "top.Split"(%16) {axis = 1 : si32, num = 2 : i64, split_size = [32, 32]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>) loc(#loc360)
    %18 = "top.Weight"() : () -> tensor<32x32x3x3xf32> loc(#loc19)
    %19 = "top.Weight"() : () -> tensor<32xf32> loc(#loc20)
    %20 = "top.Conv"(%17#1, %18, %19) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<32x32x3x3xf32>, tensor<32xf32>) -> tensor<*xf32> loc(#loc21)
    %21 = "top.Sigmoid"(%20) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc22)
    %22 = "top.Mul"(%20, %21) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc23)
    %23 = "top.Weight"() : () -> tensor<32x32x3x3xf32> loc(#loc24)
    %24 = "top.Weight"() : () -> tensor<32xf32> loc(#loc25)
    %25 = "top.Conv"(%22, %23, %24) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<32x32x3x3xf32>, tensor<32xf32>) -> tensor<*xf32> loc(#loc26)
    %26 = "top.Sigmoid"(%25) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc27)
    %27 = "top.Mul"(%25, %26) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc28)
    %28 = "top.Add"(%17#1, %27) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc29)
    %29 = "top.Concat"(%17#0, %17#1, %28) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc30)
    %30 = "top.Weight"() : () -> tensor<64x96x1x1xf32> loc(#loc31)
    %31 = "top.Weight"() : () -> tensor<64xf32> loc(#loc32)
    %32 = "top.Conv"(%29, %30, %31) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x96x1x1xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc33)
    %33 = "top.Sigmoid"(%32) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc34)
    %34 = "top.Mul"(%32, %33) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc35)
    %35 = "top.Weight"() : () -> tensor<128x64x3x3xf32> loc(#loc36)
    %36 = "top.Weight"() : () -> tensor<128xf32> loc(#loc37)
    %37 = "top.Conv"(%34, %35, %36) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x64x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc38)
    %38 = "top.Sigmoid"(%37) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc39)
    %39 = "top.Mul"(%37, %38) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc40)
    %40 = "top.Weight"() : () -> tensor<128x128x1x1xf32> loc(#loc41)
    %41 = "top.Weight"() : () -> tensor<128xf32> loc(#loc42)
    %42 = "top.Conv"(%39, %40, %41) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x1x1xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc43)
    %43 = "top.Sigmoid"(%42) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc44)
    %44 = "top.Mul"(%42, %43) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc45)
    %45:2 = "top.Split"(%44) {axis = 1 : si32, num = 2 : i64, split_size = [64, 64]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>) loc(#loc361)
    %46 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc48)
    %47 = "top.Weight"() : () -> tensor<64xf32> loc(#loc49)
    %48 = "top.Conv"(%45#1, %46, %47) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc50)
    %49 = "top.Sigmoid"(%48) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc51)
    %50 = "top.Mul"(%48, %49) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc52)
    %51 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc53)
    %52 = "top.Weight"() : () -> tensor<64xf32> loc(#loc54)
    %53 = "top.Conv"(%50, %51, %52) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc55)
    %54 = "top.Sigmoid"(%53) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc56)
    %55 = "top.Mul"(%53, %54) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc57)
    %56 = "top.Add"(%45#1, %55) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc58)
    %57 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc59)
    %58 = "top.Weight"() : () -> tensor<64xf32> loc(#loc60)
    %59 = "top.Conv"(%56, %57, %58) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc61)
    %60 = "top.Sigmoid"(%59) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc62)
    %61 = "top.Mul"(%59, %60) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc63)
    %62 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc64)
    %63 = "top.Weight"() : () -> tensor<64xf32> loc(#loc65)
    %64 = "top.Conv"(%61, %62, %63) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc66)
    %65 = "top.Sigmoid"(%64) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc67)
    %66 = "top.Mul"(%64, %65) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc68)
    %67 = "top.Add"(%56, %66) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc69)
    %68 = "top.Concat"(%45#0, %45#1, %56, %67) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc70)
    %69 = "top.Weight"() : () -> tensor<128x256x1x1xf32> loc(#loc71)
    %70 = "top.Weight"() : () -> tensor<128xf32> loc(#loc72)
    %71 = "top.Conv"(%68, %69, %70) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x256x1x1xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc73)
    %72 = "top.Sigmoid"(%71) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc74)
    %73 = "top.Mul"(%71, %72) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc75)
    %74 = "top.Weight"() : () -> tensor<256x128x3x3xf32> loc(#loc76)
    %75 = "top.Weight"() : () -> tensor<256xf32> loc(#loc77)
    %76 = "top.Conv"(%73, %74, %75) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x128x3x3xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc78)
    %77 = "top.Sigmoid"(%76) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc79)
    %78 = "top.Mul"(%76, %77) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc80)
    %79 = "top.Weight"() : () -> tensor<256x256x1x1xf32> loc(#loc81)
    %80 = "top.Weight"() : () -> tensor<256xf32> loc(#loc82)
    %81 = "top.Conv"(%78, %79, %80) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x256x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc83)
    %82 = "top.Sigmoid"(%81) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc84)
    %83 = "top.Mul"(%81, %82) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc85)
    %84:2 = "top.Split"(%83) {axis = 1 : si32, num = 2 : i64, split_size = [128, 128]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>) loc(#loc362)
    %85 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc88)
    %86 = "top.Weight"() : () -> tensor<128xf32> loc(#loc89)
    %87 = "top.Conv"(%84#1, %85, %86) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc90)
    %88 = "top.Sigmoid"(%87) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc91)
    %89 = "top.Mul"(%87, %88) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc92)
    %90 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc93)
    %91 = "top.Weight"() : () -> tensor<128xf32> loc(#loc94)
    %92 = "top.Conv"(%89, %90, %91) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc95)
    %93 = "top.Sigmoid"(%92) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc96)
    %94 = "top.Mul"(%92, %93) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc97)
    %95 = "top.Add"(%84#1, %94) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc98)
    %96 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc99)
    %97 = "top.Weight"() : () -> tensor<128xf32> loc(#loc100)
    %98 = "top.Conv"(%95, %96, %97) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc101)
    %99 = "top.Sigmoid"(%98) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc102)
    %100 = "top.Mul"(%98, %99) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc103)
    %101 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc104)
    %102 = "top.Weight"() : () -> tensor<128xf32> loc(#loc105)
    %103 = "top.Conv"(%100, %101, %102) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc106)
    %104 = "top.Sigmoid"(%103) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc107)
    %105 = "top.Mul"(%103, %104) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc108)
    %106 = "top.Add"(%95, %105) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc109)
    %107 = "top.Concat"(%84#0, %84#1, %95, %106) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc110)
    %108 = "top.Weight"() : () -> tensor<256x512x1x1xf32> loc(#loc111)
    %109 = "top.Weight"() : () -> tensor<256xf32> loc(#loc112)
    %110 = "top.Conv"(%107, %108, %109) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x512x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc113)
    %111 = "top.Sigmoid"(%110) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc114)
    %112 = "top.Mul"(%110, %111) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc115)
    %113 = "top.Weight"() : () -> tensor<512x256x3x3xf32> loc(#loc116)
    %114 = "top.Weight"() : () -> tensor<512xf32> loc(#loc117)
    %115 = "top.Conv"(%112, %113, %114) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<512x256x3x3xf32>, tensor<512xf32>) -> tensor<*xf32> loc(#loc118)
    %116 = "top.Sigmoid"(%115) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc119)
    %117 = "top.Mul"(%115, %116) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc120)
    %118 = "top.Weight"() : () -> tensor<512x512x1x1xf32> loc(#loc121)
    %119 = "top.Weight"() : () -> tensor<512xf32> loc(#loc122)
    %120 = "top.Conv"(%117, %118, %119) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<512x512x1x1xf32>, tensor<512xf32>) -> tensor<*xf32> loc(#loc123)
    %121 = "top.Sigmoid"(%120) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc124)
    %122 = "top.Mul"(%120, %121) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc125)
    %123:2 = "top.Split"(%122) {axis = 1 : si32, num = 2 : i64, split_size = [256, 256]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>) loc(#loc363)
    %124 = "top.Weight"() : () -> tensor<256x256x3x3xf32> loc(#loc128)
    %125 = "top.Weight"() : () -> tensor<256xf32> loc(#loc129)
    %126 = "top.Conv"(%123#1, %124, %125) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc130)
    %127 = "top.Sigmoid"(%126) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc131)
    %128 = "top.Mul"(%126, %127) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc132)
    %129 = "top.Weight"() : () -> tensor<256x256x3x3xf32> loc(#loc133)
    %130 = "top.Weight"() : () -> tensor<256xf32> loc(#loc134)
    %131 = "top.Conv"(%128, %129, %130) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc135)
    %132 = "top.Sigmoid"(%131) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc136)
    %133 = "top.Mul"(%131, %132) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc137)
    %134 = "top.Add"(%123#1, %133) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc138)
    %135 = "top.Concat"(%123#0, %123#1, %134) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc139)
    %136 = "top.Weight"() : () -> tensor<512x768x1x1xf32> loc(#loc140)
    %137 = "top.Weight"() : () -> tensor<512xf32> loc(#loc141)
    %138 = "top.Conv"(%135, %136, %137) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<512x768x1x1xf32>, tensor<512xf32>) -> tensor<*xf32> loc(#loc142)
    %139 = "top.Sigmoid"(%138) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc143)
    %140 = "top.Mul"(%138, %139) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc144)
    %141 = "top.Weight"() : () -> tensor<256x512x1x1xf32> loc(#loc145)
    %142 = "top.Weight"() : () -> tensor<256xf32> loc(#loc146)
    %143 = "top.Conv"(%140, %141, %142) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x512x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc147)
    %144 = "top.Sigmoid"(%143) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc148)
    %145 = "top.Mul"(%143, %144) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc149)
    %146 = "top.MaxPool"(%145) {auto_pad = "NOTSET", ceil_mode = false, count_include_pad = false, do_relu = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], relu_limit = -1.000000e+00 : f64, strides = [1, 1]} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc150)
    %147 = "top.MaxPool"(%146) {auto_pad = "NOTSET", ceil_mode = false, count_include_pad = false, do_relu = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], relu_limit = -1.000000e+00 : f64, strides = [1, 1]} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc151)
    %148 = "top.MaxPool"(%147) {auto_pad = "NOTSET", ceil_mode = false, count_include_pad = false, do_relu = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], relu_limit = -1.000000e+00 : f64, strides = [1, 1]} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc152)
    %149 = "top.Concat"(%145, %146, %147, %148) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc153)
    %150 = "top.Weight"() : () -> tensor<512x1024x1x1xf32> loc(#loc154)
    %151 = "top.Weight"() : () -> tensor<512xf32> loc(#loc155)
    %152 = "top.Conv"(%149, %150, %151) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<512x1024x1x1xf32>, tensor<512xf32>) -> tensor<*xf32> loc(#loc156)
    %153 = "top.Sigmoid"(%152) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc157)
    %154 = "top.Mul"(%152, %153) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc158)
    %155 = "top.Interp"(%154, %0) {coord_mode = "asymmetric", mode = "nearest", scale_h = 2.000000e+00 : f64, scale_w = 2.000000e+00 : f64} : (tensor<*xf32>, none) -> tensor<*xf32> loc(#loc159)
    %156 = "top.Concat"(%155, %112) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc160)
    %157 = "top.Weight"() : () -> tensor<256x768x1x1xf32> loc(#loc161)
    %158 = "top.Weight"() : () -> tensor<256xf32> loc(#loc162)
    %159 = "top.Conv"(%156, %157, %158) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x768x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc163)
    %160 = "top.Sigmoid"(%159) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc164)
    %161 = "top.Mul"(%159, %160) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc165)
    %162:2 = "top.Split"(%161) {axis = 1 : si32, num = 2 : i64, split_size = [128, 128]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>) loc(#loc364)
    %163 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc168)
    %164 = "top.Weight"() : () -> tensor<128xf32> loc(#loc169)
    %165 = "top.Conv"(%162#1, %163, %164) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc170)
    %166 = "top.Sigmoid"(%165) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc171)
    %167 = "top.Mul"(%165, %166) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc172)
    %168 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc173)
    %169 = "top.Weight"() : () -> tensor<128xf32> loc(#loc174)
    %170 = "top.Conv"(%167, %168, %169) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc175)
    %171 = "top.Sigmoid"(%170) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc176)
    %172 = "top.Mul"(%170, %171) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc177)
    %173 = "top.Concat"(%162#0, %162#1, %172) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc178)
    %174 = "top.Weight"() : () -> tensor<256x384x1x1xf32> loc(#loc179)
    %175 = "top.Weight"() : () -> tensor<256xf32> loc(#loc180)
    %176 = "top.Conv"(%173, %174, %175) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x384x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc181)
    %177 = "top.Sigmoid"(%176) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc182)
    %178 = "top.Mul"(%176, %177) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc183)
    %179 = "top.Interp"(%178, %0) {coord_mode = "asymmetric", mode = "nearest", scale_h = 2.000000e+00 : f64, scale_w = 2.000000e+00 : f64} : (tensor<*xf32>, none) -> tensor<*xf32> loc(#loc184)
    %180 = "top.Concat"(%179, %73) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc185)
    %181 = "top.Weight"() : () -> tensor<128x384x1x1xf32> loc(#loc186)
    %182 = "top.Weight"() : () -> tensor<128xf32> loc(#loc187)
    %183 = "top.Conv"(%180, %181, %182) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x384x1x1xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc188)
    %184 = "top.Sigmoid"(%183) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc189)
    %185 = "top.Mul"(%183, %184) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc190)
    %186:2 = "top.Split"(%185) {axis = 1 : si32, num = 2 : i64, split_size = [64, 64]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>) loc(#loc365)
    %187 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc193)
    %188 = "top.Weight"() : () -> tensor<64xf32> loc(#loc194)
    %189 = "top.Conv"(%186#1, %187, %188) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc195)
    %190 = "top.Sigmoid"(%189) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc196)
    %191 = "top.Mul"(%189, %190) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc197)
    %192 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc198)
    %193 = "top.Weight"() : () -> tensor<64xf32> loc(#loc199)
    %194 = "top.Conv"(%191, %192, %193) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc200)
    %195 = "top.Sigmoid"(%194) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc201)
    %196 = "top.Mul"(%194, %195) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc202)
    %197 = "top.Concat"(%186#0, %186#1, %196) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc203)
    %198 = "top.Weight"() : () -> tensor<128x192x1x1xf32> loc(#loc204)
    %199 = "top.Weight"() : () -> tensor<128xf32> loc(#loc205)
    %200 = "top.Conv"(%197, %198, %199) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x192x1x1xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc206)
    %201 = "top.Sigmoid"(%200) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc207)
    %202 = "top.Mul"(%200, %201) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc208)
    %203 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc209)
    %204 = "top.Weight"() : () -> tensor<128xf32> loc(#loc210)
    %205 = "top.Conv"(%202, %203, %204) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc211)
    %206 = "top.Weight"() : () -> tensor<64x128x3x3xf32> loc(#loc212)
    %207 = "top.Weight"() : () -> tensor<64xf32> loc(#loc213)
    %208 = "top.Conv"(%202, %206, %207) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x128x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc214)
    %209 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc215)
    %210 = "top.Weight"() : () -> tensor<128xf32> loc(#loc216)
    %211 = "top.Conv"(%202, %209, %210) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc217)
    %212 = "top.Sigmoid"(%205) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc218)
    %213 = "top.Sigmoid"(%208) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc219)
    %214 = "top.Sigmoid"(%211) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc220)
    %215 = "top.Mul"(%205, %212) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc221)
    %216 = "top.Mul"(%208, %213) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc222)
    %217 = "top.Mul"(%211, %214) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc223)
    %218 = "top.Concat"(%215, %178) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc224)
    %219 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc225)
    %220 = "top.Weight"() : () -> tensor<64xf32> loc(#loc226)
    %221 = "top.Conv"(%216, %219, %220) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc227)
    %222 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc228)
    %223 = "top.Weight"() : () -> tensor<128xf32> loc(#loc229)
    %224 = "top.Conv"(%217, %222, %223) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc230)
    %225 = "top.Weight"() : () -> tensor<256x384x1x1xf32> loc(#loc231)
    %226 = "top.Weight"() : () -> tensor<256xf32> loc(#loc232)
    %227 = "top.Conv"(%218, %225, %226) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x384x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc233)
    %228 = "top.Sigmoid"(%221) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc234)
    %229 = "top.Sigmoid"(%224) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc235)
    %230 = "top.Sigmoid"(%227) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc236)
    %231 = "top.Mul"(%221, %228) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc237)
    %232 = "top.Mul"(%224, %229) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc238)
    %233 = "top.Mul"(%227, %230) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc239)
    %234 = "top.Weight"() : () -> tensor<64x64x1x1xf32> loc(#loc240)
    %235 = "top.Weight"() : () -> tensor<64xf32> loc(#loc241)
    %236 = "top.Conv"(%231, %234, %235) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x1x1xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc242)
    %237 = "top.Weight"() : () -> tensor<1x128x1x1xf32> loc(#loc243)
    %238 = "top.Weight"() : () -> tensor<1xf32> loc(#loc244)
    %239 = "top.Conv"(%232, %237, %238) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<1x128x1x1xf32>, tensor<1xf32>) -> tensor<*xf32> loc(#loc245)
    %240:2 = "top.Split"(%233) {axis = 1 : si32, num = 2 : i64, split_size = [128, 128]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>) loc(#loc366)
    %241 = "top.Concat"(%236, %239) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc248)
    %242 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc249)
    %243 = "top.Weight"() : () -> tensor<128xf32> loc(#loc250)
    %244 = "top.Conv"(%240#1, %242, %243) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc251)
    %245 = "top.Reshape"(%241) {shape = [1, 65, -1]} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc252)
    %246 = "top.Sigmoid"(%244) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc253)
    %247 = "top.Mul"(%244, %246) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc254)
    %248 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc255)
    %249 = "top.Weight"() : () -> tensor<128xf32> loc(#loc256)
    %250 = "top.Conv"(%247, %248, %249) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc257)
    %251 = "top.Sigmoid"(%250) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc258)
    %252 = "top.Mul"(%250, %251) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc259)
    %253 = "top.Concat"(%240#0, %240#1, %252) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc260)
    %254 = "top.Weight"() : () -> tensor<256x384x1x1xf32> loc(#loc261)
    %255 = "top.Weight"() : () -> tensor<256xf32> loc(#loc262)
    %256 = "top.Conv"(%253, %254, %255) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x384x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc263)
    %257 = "top.Sigmoid"(%256) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc264)
    %258 = "top.Mul"(%256, %257) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc265)
    %259 = "top.Weight"() : () -> tensor<256x256x3x3xf32> loc(#loc266)
    %260 = "top.Weight"() : () -> tensor<256xf32> loc(#loc267)
    %261 = "top.Conv"(%258, %259, %260) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc268)
    %262 = "top.Weight"() : () -> tensor<64x256x3x3xf32> loc(#loc269)
    %263 = "top.Weight"() : () -> tensor<64xf32> loc(#loc270)
    %264 = "top.Conv"(%258, %262, %263) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x256x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc271)
    %265 = "top.Weight"() : () -> tensor<128x256x3x3xf32> loc(#loc272)
    %266 = "top.Weight"() : () -> tensor<128xf32> loc(#loc273)
    %267 = "top.Conv"(%258, %265, %266) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x256x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc274)
    %268 = "top.Sigmoid"(%261) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc275)
    %269 = "top.Sigmoid"(%264) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc276)
    %270 = "top.Sigmoid"(%267) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc277)
    %271 = "top.Mul"(%261, %268) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc278)
    %272 = "top.Mul"(%264, %269) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc279)
    %273 = "top.Mul"(%267, %270) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc280)
    %274 = "top.Concat"(%271, %154) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc281)
    %275 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc282)
    %276 = "top.Weight"() : () -> tensor<64xf32> loc(#loc283)
    %277 = "top.Conv"(%272, %275, %276) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc284)
    %278 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc285)
    %279 = "top.Weight"() : () -> tensor<128xf32> loc(#loc286)
    %280 = "top.Conv"(%273, %278, %279) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc287)
    %281 = "top.Weight"() : () -> tensor<512x768x1x1xf32> loc(#loc288)
    %282 = "top.Weight"() : () -> tensor<512xf32> loc(#loc289)
    %283 = "top.Conv"(%274, %281, %282) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<512x768x1x1xf32>, tensor<512xf32>) -> tensor<*xf32> loc(#loc290)
    %284 = "top.Sigmoid"(%277) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc291)
    %285 = "top.Sigmoid"(%280) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc292)
    %286 = "top.Sigmoid"(%283) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc293)
    %287 = "top.Mul"(%277, %284) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc294)
    %288 = "top.Mul"(%280, %285) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc295)
    %289 = "top.Mul"(%283, %286) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc296)
    %290 = "top.Weight"() : () -> tensor<64x64x1x1xf32> loc(#loc297)
    %291 = "top.Weight"() : () -> tensor<64xf32> loc(#loc298)
    %292 = "top.Conv"(%287, %290, %291) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x1x1xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc299)
    %293 = "top.Weight"() : () -> tensor<1x128x1x1xf32> loc(#loc300)
    %294 = "top.Weight"() : () -> tensor<1xf32> loc(#loc301)
    %295 = "top.Conv"(%288, %293, %294) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<1x128x1x1xf32>, tensor<1xf32>) -> tensor<*xf32> loc(#loc302)
    %296:2 = "top.Split"(%289) {axis = 1 : si32, num = 2 : i64, split_size = [256, 256]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>) loc(#loc367)
    %297 = "top.Concat"(%292, %295) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc305)
    %298 = "top.Weight"() : () -> tensor<256x256x3x3xf32> loc(#loc306)
    %299 = "top.Weight"() : () -> tensor<256xf32> loc(#loc307)
    %300 = "top.Conv"(%296#1, %298, %299) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc308)
    %301 = "top.Reshape"(%297) {shape = [1, 65, -1]} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc309)
    %302 = "top.Sigmoid"(%300) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc310)
    %303 = "top.Mul"(%300, %302) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc311)
    %304 = "top.Weight"() : () -> tensor<256x256x3x3xf32> loc(#loc312)
    %305 = "top.Weight"() : () -> tensor<256xf32> loc(#loc313)
    %306 = "top.Conv"(%303, %304, %305) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc314)
    %307 = "top.Sigmoid"(%306) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc315)
    %308 = "top.Mul"(%306, %307) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc316)
    %309 = "top.Concat"(%296#0, %296#1, %308) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc317)
    %310 = "top.Weight"() : () -> tensor<512x768x1x1xf32> loc(#loc318)
    %311 = "top.Weight"() : () -> tensor<512xf32> loc(#loc319)
