#loc = loc(unknown)
module @yolov8s attributes {module.FLOPs = 28709930000 : i64, module.chip = "ALL", module.platform = "ONNX", module.state = "TOP_F32", module.weight_file = "yolov8s_top_f32_all_weight.npz"} {
  func.func @main(%arg0: tensor<1x3x640x640xf32> loc(unknown)) -> (tensor<1x1x8400xf32>, tensor<1x1x4x8400xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {black_level = 1.120000e+02 : f64, channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [640, 640], scale = [0.0039215688593685627, 0.0039215688593685627, 0.0039215688593685627], white_level = 4.095000e+03 : f64} : (tensor<1x3x640x640xf32>) -> tensor<1x3x640x640xf32> loc(#loc1)
    %2 = "top.Weight"() : () -> tensor<32x3x3x3xf32> loc(#loc2)
    %3 = "top.Weight"() : () -> tensor<32xf32> loc(#loc3)
    %4 = "top.Conv"(%1, %2, %3) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<1x3x640x640xf32>, tensor<32x3x3x3xf32>, tensor<32xf32>) -> tensor<1x32x320x320xf32> loc(#loc4)
    %5 = "top.SiLU"(%4) : (tensor<1x32x320x320xf32>) -> tensor<1x32x320x320xf32> loc(#loc5)
    %6 = "top.Weight"() : () -> tensor<64x32x3x3xf32> loc(#loc6)
    %7 = "top.Weight"() : () -> tensor<64xf32> loc(#loc7)
    %8 = "top.Conv"(%5, %6, %7) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<1x32x320x320xf32>, tensor<64x32x3x3xf32>, tensor<64xf32>) -> tensor<1x64x160x160xf32> loc(#loc8)
    %9 = "top.SiLU"(%8) : (tensor<1x64x160x160xf32>) -> tensor<1x64x160x160xf32> loc(#loc9)
    %10 = "top.Weight"() : () -> tensor<64x64x1x1xf32> loc(#loc10)
    %11 = "top.Weight"() : () -> tensor<64xf32> loc(#loc11)
    %12 = "top.Conv"(%9, %10, %11) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x160x160xf32>, tensor<64x64x1x1xf32>, tensor<64xf32>) -> tensor<1x64x160x160xf32> loc(#loc12)
    %13 = "top.SiLU"(%12) : (tensor<1x64x160x160xf32>) -> tensor<1x64x160x160xf32> loc(#loc13)
    %14 = "top.Slice"(%13, %0, %0, %0) {axes = [], ends = [-1, 32, -1, -1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x160x160xf32>, none, none, none) -> tensor<1x32x160x160xf32> loc(#loc14)
    %15 = "top.Slice"(%13, %0, %0, %0) {axes = [], ends = [-1, 64, -1, -1], offset = [0, 32, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x160x160xf32>, none, none, none) -> tensor<1x32x160x160xf32> loc(#loc15)
    %16 = "top.Weight"() : () -> tensor<32x32x3x3xf32> loc(#loc16)
    %17 = "top.Weight"() : () -> tensor<32xf32> loc(#loc17)
    %18 = "top.Conv"(%15, %16, %17) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x32x160x160xf32>, tensor<32x32x3x3xf32>, tensor<32xf32>) -> tensor<1x32x160x160xf32> loc(#loc18)
    %19 = "top.SiLU"(%18) : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf32> loc(#loc19)
    %20 = "top.Weight"() : () -> tensor<32x32x3x3xf32> loc(#loc20)
    %21 = "top.Weight"() : () -> tensor<32xf32> loc(#loc21)
    %22 = "top.Conv"(%19, %20, %21) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x32x160x160xf32>, tensor<32x32x3x3xf32>, tensor<32xf32>) -> tensor<1x32x160x160xf32> loc(#loc22)
    %23 = "top.SiLU"(%22) : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf32> loc(#loc23)
    %24 = "top.Add"(%15, %23) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x32x160x160xf32>, tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf32> loc(#loc24)
    %25 = "top.Concat"(%14, %15, %24) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x32x160x160xf32>, tensor<1x32x160x160xf32>, tensor<1x32x160x160xf32>) -> tensor<1x96x160x160xf32> loc(#loc25)
    %26 = "top.Weight"() : () -> tensor<64x96x1x1xf32> loc(#loc26)
    %27 = "top.Weight"() : () -> tensor<64xf32> loc(#loc27)
    %28 = "top.Conv"(%25, %26, %27) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x96x160x160xf32>, tensor<64x96x1x1xf32>, tensor<64xf32>) -> tensor<1x64x160x160xf32> loc(#loc28)
    %29 = "top.SiLU"(%28) : (tensor<1x64x160x160xf32>) -> tensor<1x64x160x160xf32> loc(#loc29)
    %30 = "top.Weight"() : () -> tensor<128x64x3x3xf32> loc(#loc30)
    %31 = "top.Weight"() : () -> tensor<128xf32> loc(#loc31)
    %32 = "top.Conv"(%29, %30, %31) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<1x64x160x160xf32>, tensor<128x64x3x3xf32>, tensor<128xf32>) -> tensor<1x128x80x80xf32> loc(#loc32)
    %33 = "top.SiLU"(%32) : (tensor<1x128x80x80xf32>) -> tensor<1x128x80x80xf32> loc(#loc33)
    %34 = "top.Weight"() : () -> tensor<128x128x1x1xf32> loc(#loc34)
    %35 = "top.Weight"() : () -> tensor<128xf32> loc(#loc35)
    %36 = "top.Conv"(%33, %34, %35) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x80x80xf32>, tensor<128x128x1x1xf32>, tensor<128xf32>) -> tensor<1x128x80x80xf32> loc(#loc36)
    %37 = "top.SiLU"(%36) : (tensor<1x128x80x80xf32>) -> tensor<1x128x80x80xf32> loc(#loc37)
    %38 = "top.Slice"(%37, %0, %0, %0) {axes = [], ends = [-1, 64, -1, -1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x80x80xf32>, none, none, none) -> tensor<1x64x80x80xf32> loc(#loc38)
    %39 = "top.Slice"(%37, %0, %0, %0) {axes = [], ends = [-1, 128, -1, -1], offset = [0, 64, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x80x80xf32>, none, none, none) -> tensor<1x64x80x80xf32> loc(#loc39)
    %40 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc40)
    %41 = "top.Weight"() : () -> tensor<64xf32> loc(#loc41)
    %42 = "top.Conv"(%39, %40, %41) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x80x80xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<1x64x80x80xf32> loc(#loc42)
    %43 = "top.SiLU"(%42) : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc43)
    %44 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc44)
    %45 = "top.Weight"() : () -> tensor<64xf32> loc(#loc45)
    %46 = "top.Conv"(%43, %44, %45) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x80x80xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<1x64x80x80xf32> loc(#loc46)
    %47 = "top.SiLU"(%46) : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc47)
    %48 = "top.Add"(%39, %47) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x80x80xf32>, tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc48)
    %49 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc49)
    %50 = "top.Weight"() : () -> tensor<64xf32> loc(#loc50)
    %51 = "top.Conv"(%48, %49, %50) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x80x80xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<1x64x80x80xf32> loc(#loc51)
    %52 = "top.SiLU"(%51) : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc52)
    %53 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc53)
    %54 = "top.Weight"() : () -> tensor<64xf32> loc(#loc54)
    %55 = "top.Conv"(%52, %53, %54) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x80x80xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<1x64x80x80xf32> loc(#loc55)
    %56 = "top.SiLU"(%55) : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc56)
    %57 = "top.Add"(%48, %56) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x80x80xf32>, tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc57)
    %58 = "top.Concat"(%38, %39, %48, %57) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x80x80xf32>, tensor<1x64x80x80xf32>, tensor<1x64x80x80xf32>, tensor<1x64x80x80xf32>) -> tensor<1x256x80x80xf32> loc(#loc58)
    %59 = "top.Weight"() : () -> tensor<128x256x1x1xf32> loc(#loc59)
    %60 = "top.Weight"() : () -> tensor<128xf32> loc(#loc60)
    %61 = "top.Conv"(%58, %59, %60) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x80x80xf32>, tensor<128x256x1x1xf32>, tensor<128xf32>) -> tensor<1x128x80x80xf32> loc(#loc61)
    %62 = "top.SiLU"(%61) : (tensor<1x128x80x80xf32>) -> tensor<1x128x80x80xf32> loc(#loc62)
    %63 = "top.Weight"() : () -> tensor<256x128x3x3xf32> loc(#loc63)
    %64 = "top.Weight"() : () -> tensor<256xf32> loc(#loc64)
    %65 = "top.Conv"(%62, %63, %64) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<1x128x80x80xf32>, tensor<256x128x3x3xf32>, tensor<256xf32>) -> tensor<1x256x40x40xf32> loc(#loc65)
    %66 = "top.SiLU"(%65) : (tensor<1x256x40x40xf32>) -> tensor<1x256x40x40xf32> loc(#loc66)
    %67 = "top.Weight"() : () -> tensor<256x256x1x1xf32> loc(#loc67)
    %68 = "top.Weight"() : () -> tensor<256xf32> loc(#loc68)
    %69 = "top.Conv"(%66, %67, %68) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x40x40xf32>, tensor<256x256x1x1xf32>, tensor<256xf32>) -> tensor<1x256x40x40xf32> loc(#loc69)
    %70 = "top.SiLU"(%69) : (tensor<1x256x40x40xf32>) -> tensor<1x256x40x40xf32> loc(#loc70)
    %71 = "top.Slice"(%70, %0, %0, %0) {axes = [], ends = [-1, 128, -1, -1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x40x40xf32>, none, none, none) -> tensor<1x128x40x40xf32> loc(#loc71)
    %72 = "top.Slice"(%70, %0, %0, %0) {axes = [], ends = [-1, 256, -1, -1], offset = [0, 128, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x40x40xf32>, none, none, none) -> tensor<1x128x40x40xf32> loc(#loc72)
    %73 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc73)
    %74 = "top.Weight"() : () -> tensor<128xf32> loc(#loc74)
    %75 = "top.Conv"(%72, %73, %74) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x40x40xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x40x40xf32> loc(#loc75)
    %76 = "top.SiLU"(%75) : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc76)
    %77 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc77)
    %78 = "top.Weight"() : () -> tensor<128xf32> loc(#loc78)
    %79 = "top.Conv"(%76, %77, %78) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x40x40xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x40x40xf32> loc(#loc79)
    %80 = "top.SiLU"(%79) : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc80)
    %81 = "top.Add"(%72, %80) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x40x40xf32>, tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc81)
    %82 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc82)
    %83 = "top.Weight"() : () -> tensor<128xf32> loc(#loc83)
    %84 = "top.Conv"(%81, %82, %83) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x40x40xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x40x40xf32> loc(#loc84)
    %85 = "top.SiLU"(%84) : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc85)
    %86 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc86)
    %87 = "top.Weight"() : () -> tensor<128xf32> loc(#loc87)
    %88 = "top.Conv"(%85, %86, %87) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x40x40xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x40x40xf32> loc(#loc88)
    %89 = "top.SiLU"(%88) : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc89)
    %90 = "top.Add"(%81, %89) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x40x40xf32>, tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc90)
    %91 = "top.Concat"(%71, %72, %81, %90) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x40x40xf32>, tensor<1x128x40x40xf32>, tensor<1x128x40x40xf32>, tensor<1x128x40x40xf32>) -> tensor<1x512x40x40xf32> loc(#loc91)
    %92 = "top.Weight"() : () -> tensor<256x512x1x1xf32> loc(#loc92)
    %93 = "top.Weight"() : () -> tensor<256xf32> loc(#loc93)
    %94 = "top.Conv"(%91, %92, %93) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x512x40x40xf32>, tensor<256x512x1x1xf32>, tensor<256xf32>) -> tensor<1x256x40x40xf32> loc(#loc94)
    %95 = "top.SiLU"(%94) : (tensor<1x256x40x40xf32>) -> tensor<1x256x40x40xf32> loc(#loc95)
    %96 = "top.Weight"() : () -> tensor<512x256x3x3xf32> loc(#loc96)
    %97 = "top.Weight"() : () -> tensor<512xf32> loc(#loc97)
    %98 = "top.Conv"(%95, %96, %97) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<1x256x40x40xf32>, tensor<512x256x3x3xf32>, tensor<512xf32>) -> tensor<1x512x20x20xf32> loc(#loc98)
    %99 = "top.SiLU"(%98) : (tensor<1x512x20x20xf32>) -> tensor<1x512x20x20xf32> loc(#loc99)
    %100 = "top.Weight"() : () -> tensor<512x512x1x1xf32> loc(#loc100)
    %101 = "top.Weight"() : () -> tensor<512xf32> loc(#loc101)
    %102 = "top.Conv"(%99, %100, %101) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x512x20x20xf32>, tensor<512x512x1x1xf32>, tensor<512xf32>) -> tensor<1x512x20x20xf32> loc(#loc102)
    %103 = "top.SiLU"(%102) : (tensor<1x512x20x20xf32>) -> tensor<1x512x20x20xf32> loc(#loc103)
    %104 = "top.Slice"(%103, %0, %0, %0) {axes = [], ends = [-1, 256, -1, -1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x512x20x20xf32>, none, none, none) -> tensor<1x256x20x20xf32> loc(#loc104)
    %105 = "top.Slice"(%103, %0, %0, %0) {axes = [], ends = [-1, 512, -1, -1], offset = [0, 256, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x512x20x20xf32>, none, none, none) -> tensor<1x256x20x20xf32> loc(#loc105)
    %106 = "top.Weight"() : () -> tensor<256x256x3x3xf32> loc(#loc106)
    %107 = "top.Weight"() : () -> tensor<256xf32> loc(#loc107)
    %108 = "top.Conv"(%105, %106, %107) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x20x20xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>) -> tensor<1x256x20x20xf32> loc(#loc108)
    %109 = "top.SiLU"(%108) : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc109)
    %110 = "top.Weight"() : () -> tensor<256x256x3x3xf32> loc(#loc110)
    %111 = "top.Weight"() : () -> tensor<256xf32> loc(#loc111)
    %112 = "top.Conv"(%109, %110, %111) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x20x20xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>) -> tensor<1x256x20x20xf32> loc(#loc112)
    %113 = "top.SiLU"(%112) : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc113)
    %114 = "top.Add"(%105, %113) {do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x256x20x20xf32>, tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc114)
    %115 = "top.Concat"(%104, %105, %114) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x256x20x20xf32>, tensor<1x256x20x20xf32>, tensor<1x256x20x20xf32>) -> tensor<1x768x20x20xf32> loc(#loc115)
    %116 = "top.Weight"() : () -> tensor<512x768x1x1xf32> loc(#loc116)
    %117 = "top.Weight"() : () -> tensor<512xf32> loc(#loc117)
    %118 = "top.Conv"(%115, %116, %117) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x768x20x20xf32>, tensor<512x768x1x1xf32>, tensor<512xf32>) -> tensor<1x512x20x20xf32> loc(#loc118)
    %119 = "top.SiLU"(%118) : (tensor<1x512x20x20xf32>) -> tensor<1x512x20x20xf32> loc(#loc119)
    %120 = "top.Weight"() : () -> tensor<256x512x1x1xf32> loc(#loc120)
    %121 = "top.Weight"() : () -> tensor<256xf32> loc(#loc121)
    %122 = "top.Conv"(%119, %120, %121) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x512x20x20xf32>, tensor<256x512x1x1xf32>, tensor<256xf32>) -> tensor<1x256x20x20xf32> loc(#loc122)
    %123 = "top.SiLU"(%122) : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc123)
    %124 = "top.MaxPool"(%123) {count_include_pad = false, do_relu = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], relu_limit = -1.000000e+00 : f64, strides = [1, 1]} : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc124)
    %125 = "top.MaxPool"(%124) {count_include_pad = false, do_relu = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], relu_limit = -1.000000e+00 : f64, strides = [1, 1]} : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc125)
    %126 = "top.MaxPool"(%125) {count_include_pad = false, do_relu = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], relu_limit = -1.000000e+00 : f64, strides = [1, 1]} : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc126)
    %127 = "top.Concat"(%123, %124, %125, %126) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x256x20x20xf32>, tensor<1x256x20x20xf32>, tensor<1x256x20x20xf32>, tensor<1x256x20x20xf32>) -> tensor<1x1024x20x20xf32> loc(#loc127)
    %128 = "top.Weight"() : () -> tensor<512x1024x1x1xf32> loc(#loc128)
    %129 = "top.Weight"() : () -> tensor<512xf32> loc(#loc129)
    %130 = "top.Conv"(%127, %128, %129) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x1024x20x20xf32>, tensor<512x1024x1x1xf32>, tensor<512xf32>) -> tensor<1x512x20x20xf32> loc(#loc130)
    %131 = "top.SiLU"(%130) : (tensor<1x512x20x20xf32>) -> tensor<1x512x20x20xf32> loc(#loc131)
    %132 = "top.Upsample"(%131) {do_relu = false, relu_limit = -1.000000e+00 : f64, scale_h = 2 : i64, scale_w = 2 : i64} : (tensor<1x512x20x20xf32>) -> tensor<1x512x40x40xf32> loc(#loc132)
    %133 = "top.Concat"(%132, %95) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x512x40x40xf32>, tensor<1x256x40x40xf32>) -> tensor<1x768x40x40xf32> loc(#loc133)
    %134 = "top.Weight"() : () -> tensor<256x768x1x1xf32> loc(#loc134)
    %135 = "top.Weight"() : () -> tensor<256xf32> loc(#loc135)
    %136 = "top.Conv"(%133, %134, %135) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x768x40x40xf32>, tensor<256x768x1x1xf32>, tensor<256xf32>) -> tensor<1x256x40x40xf32> loc(#loc136)
    %137 = "top.SiLU"(%136) : (tensor<1x256x40x40xf32>) -> tensor<1x256x40x40xf32> loc(#loc137)
    %138 = "top.Slice"(%137, %0, %0, %0) {axes = [], ends = [-1, 128, -1, -1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x40x40xf32>, none, none, none) -> tensor<1x128x40x40xf32> loc(#loc138)
    %139 = "top.Slice"(%137, %0, %0, %0) {axes = [], ends = [-1, 256, -1, -1], offset = [0, 128, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x40x40xf32>, none, none, none) -> tensor<1x128x40x40xf32> loc(#loc139)
    %140 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc140)
    %141 = "top.Weight"() : () -> tensor<128xf32> loc(#loc141)
    %142 = "top.Conv"(%139, %140, %141) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x40x40xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x40x40xf32> loc(#loc142)
    %143 = "top.SiLU"(%142) : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc143)
    %144 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc144)
    %145 = "top.Weight"() : () -> tensor<128xf32> loc(#loc145)
    %146 = "top.Conv"(%143, %144, %145) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x40x40xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x40x40xf32> loc(#loc146)
    %147 = "top.SiLU"(%146) : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc147)
    %148 = "top.Concat"(%138, %139, %147) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x40x40xf32>, tensor<1x128x40x40xf32>, tensor<1x128x40x40xf32>) -> tensor<1x384x40x40xf32> loc(#loc148)
    %149 = "top.Weight"() : () -> tensor<256x384x1x1xf32> loc(#loc149)
    %150 = "top.Weight"() : () -> tensor<256xf32> loc(#loc150)
    %151 = "top.Conv"(%148, %149, %150) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x384x40x40xf32>, tensor<256x384x1x1xf32>, tensor<256xf32>) -> tensor<1x256x40x40xf32> loc(#loc151)
    %152 = "top.SiLU"(%151) : (tensor<1x256x40x40xf32>) -> tensor<1x256x40x40xf32> loc(#loc152)
    %153 = "top.Upsample"(%152) {do_relu = false, relu_limit = -1.000000e+00 : f64, scale_h = 2 : i64, scale_w = 2 : i64} : (tensor<1x256x40x40xf32>) -> tensor<1x256x80x80xf32> loc(#loc153)
    %154 = "top.Concat"(%153, %62) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x256x80x80xf32>, tensor<1x128x80x80xf32>) -> tensor<1x384x80x80xf32> loc(#loc154)
    %155 = "top.Weight"() : () -> tensor<128x384x1x1xf32> loc(#loc155)
    %156 = "top.Weight"() : () -> tensor<128xf32> loc(#loc156)
    %157 = "top.Conv"(%154, %155, %156) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x384x80x80xf32>, tensor<128x384x1x1xf32>, tensor<128xf32>) -> tensor<1x128x80x80xf32> loc(#loc157)
    %158 = "top.SiLU"(%157) : (tensor<1x128x80x80xf32>) -> tensor<1x128x80x80xf32> loc(#loc158)
    %159 = "top.Slice"(%158, %0, %0, %0) {axes = [], ends = [-1, 64, -1, -1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x80x80xf32>, none, none, none) -> tensor<1x64x80x80xf32> loc(#loc159)
    %160 = "top.Slice"(%158, %0, %0, %0) {axes = [], ends = [-1, 128, -1, -1], offset = [0, 64, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x80x80xf32>, none, none, none) -> tensor<1x64x80x80xf32> loc(#loc160)
    %161 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc161)
    %162 = "top.Weight"() : () -> tensor<64xf32> loc(#loc162)
    %163 = "top.Conv"(%160, %161, %162) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x80x80xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<1x64x80x80xf32> loc(#loc163)
    %164 = "top.SiLU"(%163) : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc164)
    %165 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc165)
    %166 = "top.Weight"() : () -> tensor<64xf32> loc(#loc166)
    %167 = "top.Conv"(%164, %165, %166) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x80x80xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<1x64x80x80xf32> loc(#loc167)
    %168 = "top.SiLU"(%167) : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc168)
    %169 = "top.Concat"(%159, %160, %168) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x80x80xf32>, tensor<1x64x80x80xf32>, tensor<1x64x80x80xf32>) -> tensor<1x192x80x80xf32> loc(#loc169)
    %170 = "top.Weight"() : () -> tensor<128x192x1x1xf32> loc(#loc170)
    %171 = "top.Weight"() : () -> tensor<128xf32> loc(#loc171)
    %172 = "top.Conv"(%169, %170, %171) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x192x80x80xf32>, tensor<128x192x1x1xf32>, tensor<128xf32>) -> tensor<1x128x80x80xf32> loc(#loc172)
    %173 = "top.SiLU"(%172) : (tensor<1x128x80x80xf32>) -> tensor<1x128x80x80xf32> loc(#loc173)
    %174 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc174)
    %175 = "top.Weight"() : () -> tensor<128xf32> loc(#loc175)
    %176 = "top.Conv"(%173, %174, %175) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<1x128x80x80xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x40x40xf32> loc(#loc176)
    %177 = "top.Weight"() : () -> tensor<64x128x3x3xf32> loc(#loc177)
    %178 = "top.Weight"() : () -> tensor<64xf32> loc(#loc178)
    %179 = "top.Conv"(%173, %177, %178) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x80x80xf32>, tensor<64x128x3x3xf32>, tensor<64xf32>) -> tensor<1x64x80x80xf32> loc(#loc179)
    %180 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc180)
    %181 = "top.Weight"() : () -> tensor<128xf32> loc(#loc181)
    %182 = "top.Conv"(%173, %180, %181) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x80x80xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x80x80xf32> loc(#loc182)
    %183 = "top.SiLU"(%176) : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc183)
    %184 = "top.SiLU"(%179) : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc184)
    %185 = "top.SiLU"(%182) : (tensor<1x128x80x80xf32>) -> tensor<1x128x80x80xf32> loc(#loc185)
    %186 = "top.Concat"(%183, %152) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x40x40xf32>, tensor<1x256x40x40xf32>) -> tensor<1x384x40x40xf32> loc(#loc186)
    %187 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc187)
    %188 = "top.Weight"() : () -> tensor<64xf32> loc(#loc188)
    %189 = "top.Conv"(%184, %187, %188) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x80x80xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<1x64x80x80xf32> loc(#loc189)
    %190 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc190)
    %191 = "top.Weight"() : () -> tensor<128xf32> loc(#loc191)
    %192 = "top.Conv"(%185, %190, %191) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x80x80xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x80x80xf32> loc(#loc192)
    %193 = "top.Weight"() : () -> tensor<256x384x1x1xf32> loc(#loc193)
    %194 = "top.Weight"() : () -> tensor<256xf32> loc(#loc194)
    %195 = "top.Conv"(%186, %193, %194) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x384x40x40xf32>, tensor<256x384x1x1xf32>, tensor<256xf32>) -> tensor<1x256x40x40xf32> loc(#loc195)
    %196 = "top.SiLU"(%189) : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc196)
    %197 = "top.SiLU"(%192) : (tensor<1x128x80x80xf32>) -> tensor<1x128x80x80xf32> loc(#loc197)
    %198 = "top.SiLU"(%195) : (tensor<1x256x40x40xf32>) -> tensor<1x256x40x40xf32> loc(#loc198)
    %199 = "top.Weight"() : () -> tensor<64x64x1x1xf32> loc(#loc199)
    %200 = "top.Weight"() : () -> tensor<64xf32> loc(#loc200)
    %201 = "top.Conv"(%196, %199, %200) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x80x80xf32>, tensor<64x64x1x1xf32>, tensor<64xf32>) -> tensor<1x64x80x80xf32> loc(#loc201)
    %202 = "top.Weight"() : () -> tensor<1x128x1x1xf32> loc(#loc202)
    %203 = "top.Weight"() : () -> tensor<1xf32> loc(#loc203)
    %204 = "top.Conv"(%197, %202, %203) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x80x80xf32>, tensor<1x128x1x1xf32>, tensor<1xf32>) -> tensor<1x1x80x80xf32> loc(#loc204)
    %205 = "top.Slice"(%198, %0, %0, %0) {axes = [], ends = [-1, 128, -1, -1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x40x40xf32>, none, none, none) -> tensor<1x128x40x40xf32> loc(#loc205)
    %206 = "top.Slice"(%198, %0, %0, %0) {axes = [], ends = [-1, 256, -1, -1], offset = [0, 128, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x40x40xf32>, none, none, none) -> tensor<1x128x40x40xf32> loc(#loc206)
    %207 = "top.Concat"(%201, %204) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x80x80xf32>, tensor<1x1x80x80xf32>) -> tensor<1x65x80x80xf32> loc(#loc207)
    %208 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc208)
    %209 = "top.Weight"() : () -> tensor<128xf32> loc(#loc209)
    %210 = "top.Conv"(%206, %208, %209) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x40x40xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x40x40xf32> loc(#loc210)
    %211 = "top.Reshape"(%207) : (tensor<1x65x80x80xf32>) -> tensor<1x65x6400xf32> loc(#loc211)
    %212 = "top.SiLU"(%210) : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc212)
    %213 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc213)
    %214 = "top.Weight"() : () -> tensor<128xf32> loc(#loc214)
    %215 = "top.Conv"(%212, %213, %214) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x40x40xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x40x40xf32> loc(#loc215)
    %216 = "top.SiLU"(%215) : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc216)
    %217 = "top.Concat"(%205, %206, %216) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x40x40xf32>, tensor<1x128x40x40xf32>, tensor<1x128x40x40xf32>) -> tensor<1x384x40x40xf32> loc(#loc217)
    %218 = "top.Weight"() : () -> tensor<256x384x1x1xf32> loc(#loc218)
    %219 = "top.Weight"() : () -> tensor<256xf32> loc(#loc219)
    %220 = "top.Conv"(%217, %218, %219) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x384x40x40xf32>, tensor<256x384x1x1xf32>, tensor<256xf32>) -> tensor<1x256x40x40xf32> loc(#loc220)
    %221 = "top.SiLU"(%220) : (tensor<1x256x40x40xf32>) -> tensor<1x256x40x40xf32> loc(#loc221)
    %222 = "top.Weight"() : () -> tensor<256x256x3x3xf32> loc(#loc222)
    %223 = "top.Weight"() : () -> tensor<256xf32> loc(#loc223)
    %224 = "top.Conv"(%221, %222, %223) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<1x256x40x40xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>) -> tensor<1x256x20x20xf32> loc(#loc224)
    %225 = "top.Weight"() : () -> tensor<64x256x3x3xf32> loc(#loc225)
    %226 = "top.Weight"() : () -> tensor<64xf32> loc(#loc226)
    %227 = "top.Conv"(%221, %225, %226) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x40x40xf32>, tensor<64x256x3x3xf32>, tensor<64xf32>) -> tensor<1x64x40x40xf32> loc(#loc227)
    %228 = "top.Weight"() : () -> tensor<128x256x3x3xf32> loc(#loc228)
    %229 = "top.Weight"() : () -> tensor<128xf32> loc(#loc229)
    %230 = "top.Conv"(%221, %228, %229) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x40x40xf32>, tensor<128x256x3x3xf32>, tensor<128xf32>) -> tensor<1x128x40x40xf32> loc(#loc230)
    %231 = "top.SiLU"(%224) : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc231)
    %232 = "top.SiLU"(%227) : (tensor<1x64x40x40xf32>) -> tensor<1x64x40x40xf32> loc(#loc232)
    %233 = "top.SiLU"(%230) : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc233)
    %234 = "top.Concat"(%231, %131) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x256x20x20xf32>, tensor<1x512x20x20xf32>) -> tensor<1x768x20x20xf32> loc(#loc234)
    %235 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc235)
    %236 = "top.Weight"() : () -> tensor<64xf32> loc(#loc236)
    %237 = "top.Conv"(%232, %235, %236) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x40x40xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<1x64x40x40xf32> loc(#loc237)
    %238 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc238)
    %239 = "top.Weight"() : () -> tensor<128xf32> loc(#loc239)
    %240 = "top.Conv"(%233, %238, %239) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x40x40xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x40x40xf32> loc(#loc240)
    %241 = "top.Weight"() : () -> tensor<512x768x1x1xf32> loc(#loc241)
    %242 = "top.Weight"() : () -> tensor<512xf32> loc(#loc242)
    %243 = "top.Conv"(%234, %241, %242) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x768x20x20xf32>, tensor<512x768x1x1xf32>, tensor<512xf32>) -> tensor<1x512x20x20xf32> loc(#loc243)
    %244 = "top.SiLU"(%237) : (tensor<1x64x40x40xf32>) -> tensor<1x64x40x40xf32> loc(#loc244)
    %245 = "top.SiLU"(%240) : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc245)
    %246 = "top.SiLU"(%243) : (tensor<1x512x20x20xf32>) -> tensor<1x512x20x20xf32> loc(#loc246)
    %247 = "top.Weight"() : () -> tensor<64x64x1x1xf32> loc(#loc247)
    %248 = "top.Weight"() : () -> tensor<64xf32> loc(#loc248)
    %249 = "top.Conv"(%244, %247, %248) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x40x40xf32>, tensor<64x64x1x1xf32>, tensor<64xf32>) -> tensor<1x64x40x40xf32> loc(#loc249)
    %250 = "top.Weight"() : () -> tensor<1x128x1x1xf32> loc(#loc250)
    %251 = "top.Weight"() : () -> tensor<1xf32> loc(#loc251)
    %252 = "top.Conv"(%245, %250, %251) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x40x40xf32>, tensor<1x128x1x1xf32>, tensor<1xf32>) -> tensor<1x1x40x40xf32> loc(#loc252)
    %253 = "top.Slice"(%246, %0, %0, %0) {axes = [], ends = [-1, 256, -1, -1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x512x20x20xf32>, none, none, none) -> tensor<1x256x20x20xf32> loc(#loc253)
    %254 = "top.Slice"(%246, %0, %0, %0) {axes = [], ends = [-1, 512, -1, -1], offset = [0, 256, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x512x20x20xf32>, none, none, none) -> tensor<1x256x20x20xf32> loc(#loc254)
    %255 = "top.Concat"(%249, %252) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x40x40xf32>, tensor<1x1x40x40xf32>) -> tensor<1x65x40x40xf32> loc(#loc255)
    %256 = "top.Weight"() : () -> tensor<256x256x3x3xf32> loc(#loc256)
    %257 = "top.Weight"() : () -> tensor<256xf32> loc(#loc257)
    %258 = "top.Conv"(%254, %256, %257) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x20x20xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>) -> tensor<1x256x20x20xf32> loc(#loc258)
    %259 = "top.Reshape"(%255) : (tensor<1x65x40x40xf32>) -> tensor<1x65x1600xf32> loc(#loc259)
    %260 = "top.SiLU"(%258) : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc260)
    %261 = "top.Weight"() : () -> tensor<256x256x3x3xf32> loc(#loc261)
    %262 = "top.Weight"() : () -> tensor<256xf32> loc(#loc262)
    %263 = "top.Conv"(%260, %261, %262) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x20x20xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>) -> tensor<1x256x20x20xf32> loc(#loc263)
    %264 = "top.SiLU"(%263) : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc264)
    %265 = "top.Concat"(%253, %254, %264) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x256x20x20xf32>, tensor<1x256x20x20xf32>, tensor<1x256x20x20xf32>) -> tensor<1x768x20x20xf32> loc(#loc265)
    %266 = "top.Weight"() : () -> tensor<512x768x1x1xf32> loc(#loc266)
    %267 = "top.Weight"() : () -> tensor<512xf32> loc(#loc267)
    %268 = "top.Conv"(%265, %266, %267) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x768x20x20xf32>, tensor<512x768x1x1xf32>, tensor<512xf32>) -> tensor<1x512x20x20xf32> loc(#loc268)
    %269 = "top.SiLU"(%268) : (tensor<1x512x20x20xf32>) -> tensor<1x512x20x20xf32> loc(#loc269)
    %270 = "top.Weight"() : () -> tensor<64x512x3x3xf32> loc(#loc270)
    %271 = "top.Weight"() : () -> tensor<64xf32> loc(#loc271)
    %272 = "top.Conv"(%269, %270, %271) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x512x20x20xf32>, tensor<64x512x3x3xf32>, tensor<64xf32>) -> tensor<1x64x20x20xf32> loc(#loc272)
    %273 = "top.Weight"() : () -> tensor<128x512x3x3xf32> loc(#loc273)
    %274 = "top.Weight"() : () -> tensor<128xf32> loc(#loc274)
    %275 = "top.Conv"(%269, %273, %274) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x512x20x20xf32>, tensor<128x512x3x3xf32>, tensor<128xf32>) -> tensor<1x128x20x20xf32> loc(#loc275)
    %276 = "top.SiLU"(%272) : (tensor<1x64x20x20xf32>) -> tensor<1x64x20x20xf32> loc(#loc276)
    %277 = "top.SiLU"(%275) : (tensor<1x128x20x20xf32>) -> tensor<1x128x20x20xf32> loc(#loc277)
    %278 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc278)
    %279 = "top.Weight"() : () -> tensor<64xf32> loc(#loc279)
    %280 = "top.Conv"(%276, %278, %279) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x20x20xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<1x64x20x20xf32> loc(#loc280)
    %281 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc281)
    %282 = "top.Weight"() : () -> tensor<128xf32> loc(#loc282)
    %283 = "top.Conv"(%277, %281, %282) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x20x20xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x20x20xf32> loc(#loc283)
    %284 = "top.SiLU"(%280) : (tensor<1x64x20x20xf32>) -> tensor<1x64x20x20xf32> loc(#loc284)
    %285 = "top.SiLU"(%283) : (tensor<1x128x20x20xf32>) -> tensor<1x128x20x20xf32> loc(#loc285)
    %286 = "top.Weight"() : () -> tensor<64x64x1x1xf32> loc(#loc286)
    %287 = "top.Weight"() : () -> tensor<64xf32> loc(#loc287)
    %288 = "top.Conv"(%284, %286, %287) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x20x20xf32>, tensor<64x64x1x1xf32>, tensor<64xf32>) -> tensor<1x64x20x20xf32> loc(#loc288)
    %289 = "top.Weight"() : () -> tensor<1x128x1x1xf32> loc(#loc289)
    %290 = "top.Weight"() : () -> tensor<1xf32> loc(#loc290)
    %291 = "top.Conv"(%285, %289, %290) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x20x20xf32>, tensor<1x128x1x1xf32>, tensor<1xf32>) -> tensor<1x1x20x20xf32> loc(#loc291)
    %292 = "top.Concat"(%288, %291) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x20x20xf32>, tensor<1x1x20x20xf32>) -> tensor<1x65x20x20xf32> loc(#loc292)
    %293 = "top.Reshape"(%292) : (tensor<1x65x20x20xf32>) -> tensor<1x65x400xf32> loc(#loc293)
    %294 = "top.Concat"(%211, %259, %293) {axis = 2 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x65x6400xf32>, tensor<1x65x1600xf32>, tensor<1x65x400xf32>) -> tensor<1x65x8400xf32> loc(#loc294)
    %295 = "top.Slice"(%294, %0, %0, %0) {axes = [], ends = [-1, 64, -1], offset = [0, 0, 0], steps = [1, 1, 1]} : (tensor<1x65x8400xf32>, none, none, none) -> tensor<1x64x8400xf32> loc(#loc295)
    %296 = "top.Slice"(%294, %0, %0, %0) {axes = [], ends = [-1, 65, -1], offset = [0, 64, 0], steps = [1, 1, 1]} : (tensor<1x65x8400xf32>, none, none, none) -> tensor<1x1x8400xf32> loc(#loc296)
    %297 = "top.Reshape"(%295) : (tensor<1x64x8400xf32>) -> tensor<1x4x16x8400xf32> loc(#loc297)
    %298 = "top.Sigmoid"(%296) {bias = 0.000000e+00 : f64, log = false, scale = 1.000000e+00 : f64} : (tensor<1x1x8400xf32>) -> tensor<1x1x8400xf32> loc(#loc298)
    %299 = "top.Permute"(%297) {order = [0, 2, 1, 3]} : (tensor<1x4x16x8400xf32>) -> tensor<1x16x4x8400xf32> loc(#loc299)
    %300 = "top.Softmax"(%299) {axis = 1 : si32, beta = 1.000000e+00 : f64, log = false} : (tensor<1x16x4x8400xf32>) -> tensor<1x16x4x8400xf32> loc(#loc300)
    %301 = "top.Weight"() : () -> tensor<1x16x1x1xf32> loc(#loc301)
    %302 = "top.Conv"(%300, %301, %0) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x16x4x8400xf32>, tensor<1x16x1x1xf32>, none) -> tensor<1x1x4x8400xf32> loc(#loc302)
    return %298, %302 : tensor<1x1x8400xf32>, tensor<1x1x4x8400xf32> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc1 = loc("images")
#loc2 = loc("model.0.conv.weight")
#loc3 = loc("model.0.conv.bias")
#loc4 = loc("/model.0/conv/Conv_output_0_Conv")
#loc5 = loc("/model.0/act/Mul_output_0_Mul")
#loc6 = loc("model.1.conv.weight")
#loc7 = loc("model.1.conv.bias")
#loc8 = loc("/model.1/conv/Conv_output_0_Conv")
#loc9 = loc("/model.1/act/Mul_output_0_Mul")
#loc10 = loc("model.2.cv1.conv.weight")
#loc11 = loc("model.2.cv1.conv.bias")
#loc12 = loc("/model.2/cv1/conv/Conv_output_0_Conv")
#loc13 = loc("/model.2/cv1/act/Mul_output_0_Mul")
#loc14 = loc("/model.2/Split_output_0_Split")
#loc15 = loc("/model.2/Split_output_1_Split")
#loc16 = loc("model.2.m.0.cv1.conv.weight")
#loc17 = loc("model.2.m.0.cv1.conv.bias")
#loc18 = loc("/model.2/m.0/cv1/conv/Conv_output_0_Conv")
#loc19 = loc("/model.2/m.0/cv1/act/Mul_output_0_Mul")
#loc20 = loc("model.2.m.0.cv2.conv.weight")
#loc21 = loc("model.2.m.0.cv2.conv.bias")
#loc22 = loc("/model.2/m.0/cv2/conv/Conv_output_0_Conv")
#loc23 = loc("/model.2/m.0/cv2/act/Mul_output_0_Mul")
#loc24 = loc("/model.2/m.0/Add_output_0_Add")
#loc25 = loc("/model.2/Concat_output_0_Concat")
#loc26 = loc("model.2.cv2.conv.weight")
#loc27 = loc("model.2.cv2.conv.bias")
#loc28 = loc("/model.2/cv2/conv/Conv_output_0_Conv")
#loc29 = loc("/model.2/cv2/act/Mul_output_0_Mul")
#loc30 = loc("model.3.conv.weight")
#loc31 = loc("model.3.conv.bias")
#loc32 = loc("/model.3/conv/Conv_output_0_Conv")
#loc33 = loc("/model.3/act/Mul_output_0_Mul")
#loc34 = loc("model.4.cv1.conv.weight")
#loc35 = loc("model.4.cv1.conv.bias")
#loc36 = loc("/model.4/cv1/conv/Conv_output_0_Conv")
#loc37 = loc("/model.4/cv1/act/Mul_output_0_Mul")
#loc38 = loc("/model.4/Split_output_0_Split")
#loc39 = loc("/model.4/Split_output_1_Split")
#loc40 = loc("model.4.m.0.cv1.conv.weight")
#loc41 = loc("model.4.m.0.cv1.conv.bias")
#loc42 = loc("/model.4/m.0/cv1/conv/Conv_output_0_Conv")
#loc43 = loc("/model.4/m.0/cv1/act/Mul_output_0_Mul")
#loc44 = loc("model.4.m.0.cv2.conv.weight")
#loc45 = loc("model.4.m.0.cv2.conv.bias")
#loc46 = loc("/model.4/m.0/cv2/conv/Conv_output_0_Conv")
#loc47 = loc("/model.4/m.0/cv2/act/Mul_output_0_Mul")
#loc48 = loc("/model.4/m.0/Add_output_0_Add")
