#loc = loc(unknown)
module @yolov8s attributes {module.FLOPs = 28709930000 : i64, module.asymmetric = false, module.chip = "cv181x", module.cores = 1 : i64, module.devices = 1 : i64, module.mode = "INT8", module.platform = "ONNX", module.q_group_size = 0 : i64, module.state = "TPU_LOWERED", module.weight_file = "yolov8s_tpu_lowered_cv181x_int8_sym_weight.npz"} {
  func.func @main(%arg0: tensor<1x3x640x640xf32> loc(unknown)) -> (tensor<1x1x8400xf32>, tensor<1x1x4x8400xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {black_level = 1.120000e+02 : f64, channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [640, 640], scale = [0.0039215688593685627, 0.0039215688593685627, 0.0039215688593685627], white_level = 4.095000e+03 : f64} : (tensor<1x3x640x640xf32>) -> tensor<1x3x640x640x!quant.calibrated<f32<-1.000000e+00:1.000000e+00>>> loc(#loc1)
    %2 = "tpu.GenericCpu"(%1) {cpu_op_name = "quant", param = {from = "FP32", scale = 1.270000e+02 : f32, to = "INT8"}} : (tensor<1x3x640x640x!quant.calibrated<f32<-1.000000e+00:1.000000e+00>>>) -> tensor<1x3x640x640x!quant.uniform<i8:f32, 0.0078740157480314959>> loc(#loc2)
    %3 = "top.Weight"() : () -> tensor<32x3x3x3xsi8> loc(#loc3)
    %4 = "top.Weight"() : () -> tensor<1x32x1x1xi32> loc(#loc4)
    %5 = "tpu.Conv2D"(%2, %3, %4) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1265793280, 1569679616, 1296584704, 2018731136, 1567029632, 1352549120, 1525426176, 1396860288, 1274011264, 1154450816, 2038866688, 1594866432, 1559242624, 1521292800, 1223349376, 1840832512, 1798299904, 1637056896, 1274817920, 1499105536, 1596852736, 1649411712, 2120718464, 1940123136, 1459383296, 2039636480, 1575351808, 1257958144, 1099235200, 1620748416, 2012403840, 1773068416], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [9, 10, 8, 8, 9, 10, 13, 8, 8, 9, 8, 9, 8, 10, 11, 10, 11, 8, 10, 10, 8, 8, 8, 9, 8, 9, 9, 8, 8, 9, 8, 8], strides = [2, 2], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x3x640x640x!quant.uniform<i8:f32, 0.0078740157480314959>>, tensor<32x3x3x3xsi8>, tensor<1x32x1x1xi32>) -> tensor<1x32x320x320x!quant.uniform<i8:f32, 0.468737768503937>> loc(#loc5)
    %6 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc6)
    %7 = "tpu.Lut"(%5, %6) : (tensor<1x32x320x320x!quant.uniform<i8:f32, 0.468737768503937>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x320x320x!quant.uniform<i8:f32, 0.43493836614173226>> loc(#loc7)
    %8 = "top.Weight"() : () -> tensor<64x32x3x3xsi8> loc(#loc8)
    %9 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc9)
    %10 = "tpu.Conv2D"(%7, %8, %9) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1131350784, 1527008256, 2121484032, 1614914560, 1577814656, 1206283264, 1939257088, 2105015040, 1306148224, 2053383552, 1263523712, 1994275712, 2030576640, 1658035456, 1502124800, 1294472576, 1118997248, 1159000832, 1417395584, 1125286272, 1101654912, 2037107456, 1982201472, 1259764864, 1206500864, 1763880960, 1812368896, 1884700800, 1395615488, 1358850688, 1255535616, 1544410880, 2024665600, 1405478144, 1483997568, 1532151168, 1372535168, 1079128064, 1534193920, 1800007296, 1603568384, 1392966528, 1969602432, 1650196864, 1490422144, 1582089984, 1210235904, 1715438592, 1268774272, 1167769984, 1809335808, 1829484928, 1552445696, 1385618304, 1896931968, 1500423168, 1085925248, 1991309824, 2096708736, 1396160768, 2119110656, 1583305088, 1181390976, 1296377472], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [8, 10, 9, 9, 9, 8, 8, 9, 8, 9, 8, 8, 10, 9, 8, 9, 8, 7, 9, 8, 8, 10, 9, 8, 9, 9, 9, 8, 8, 8, 8, 9, 9, 8, 6, 8, 9, 6, 9, 9, 9, 9, 9, 8, 8, 9, 9, 7, 9, 7, 9, 8, 8, 8, 8, 9, 8, 9, 9, 8, 7, 9, 8, 9], strides = [2, 2], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x320x320x!quant.uniform<i8:f32, 0.43493836614173226>>, tensor<64x32x3x3xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.68807983385826776>> loc(#loc10)
    %11 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc11)
    %12 = "tpu.Lut"(%10, %11) : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.68807983385826776>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.71302666220472444>> loc(#loc12)
    %13 = "top.Weight"() : () -> tensor<64x64x1x1xsi8> loc(#loc13)
    %14 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc14)
    %15 = "tpu.Conv2D"(%12, %13, %14) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [1723091456, 1726953344, 1804171008, 1267471616, 1972229120, 1990395136, 1886459008, 1341448192, 1172764416, 1543507328, 2080992256, 1089906304, 1953573376, 1280979456, 1385259264, 1212554624, 1338923264, 1253429248, 1106408704, 1125325312, 1107191808, 1611865088, 1417780736, 1173316480, 1784647936, 1293525888, 1284428928, 1824482048, 1184463360, 1079699072, 1373822848, 1100371072, 1708049024, 1644037376, 1896467072, 1268056576, 1456445184, 2005108224, 1477475584, 1203879424, 1109269504, 1852734464, 2115003776, 1393746176, 1932027776, 1937668096, 1321634432, 1143729024, 1231702656, 1148573184, 1135718144, 1169727360, 1252650496, 2023098496, 1414957568, 1663012096, 1181634176, 1089519744, 1370930432, 1354904576, 1486147968, 1350564992, 1640670848, 1531552384], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [7, 7, 7, 6, 7, 8, 8, 7, 7, 8, 7, 7, 7, 7, 7, 7, 8, 7, 6, 6, 8, 7, 8, 6, 7, 8, 8, 9, 6, 8, 8, 7, 7, 8, 6, 9, 9, 8, 7, 8, 8, 8, 10, 7, 7, 7, 9, 7, 7, 8, 8, 9, 6, 9, 7, 7, 8, 6, 8, 8, 7, 9, 7, 9], strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.71302666220472444>>, tensor<64x64x1x1xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.42168459527559055>> loc(#loc15)
    %16 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc16)
    %17 = "tpu.Lut"(%15, %16) : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.42168459527559055>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.23781815511811022>> loc(#loc17)
    %18 = "tpu.Slice"(%17, %0, %0, %0, %0) {axes = [], ends = [-1, 32, -1, -1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.23781815511811022>>, none, none, none, none) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>> loc(#loc18)
    %19 = "tpu.Slice"(%17, %0, %0, %0, %0) {axes = [], ends = [-1, 64, -1, -1], offset = [0, 32, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.23781815511811022>>, none, none, none, none) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>> loc(#loc19)
    %20 = "top.Weight"() : () -> tensor<32x32x3x3xsi8> loc(#loc20)
    %21 = "top.Weight"() : () -> tensor<1x32x1x1xi32> loc(#loc21)
    %22 = "tpu.Conv2D"(%19, %20, %21) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1317804544, 1138883328, 2064341760, 1469157504, 1765506688, 1703511680, 1472893184, 1902377984, 1642164224, 1137344256, 1903926656, 1240219776, 1647682560, 1483861632, 1306007040, 1082450688, 2009209856, 1272203264, 1123714432, 1476564096, 1860892672, 2027635072, 1453548672, 1841936256, 1743810944, 1741225088, 1247752064, 1263304704, 1454017024, 1747740800, 1535490304, 1506494976], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [6, 6, 7, 7, 8, 7, 6, 8, 7, 6, 7, 7, 7, 7, 6, 6, 7, 6, 7, 7, 7, 8, 6, 7, 7, 7, 7, 8, 7, 7, 7, 7], strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>>, tensor<32x32x3x3xsi8>, tensor<1x32x1x1xi32>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.30551811259842521>> loc(#loc22)
    %23 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc23)
    %24 = "tpu.Lut"(%22, %23) : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.30551811259842521>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.2259418968503937>> loc(#loc24)
    %25 = "top.Weight"() : () -> tensor<32x32x3x3xsi8> loc(#loc25)
    %26 = "top.Weight"() : () -> tensor<1x32x1x1xi32> loc(#loc26)
    %27 = "tpu.Conv2D"(%24, %25, %26) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1422918656, 1222686592, 1489004160, 1183626240, 1446121600, 1135194752, 2059077760, 1749702144, 1628918400, 1176187264, 2108989696, 1312244992, 1648986496, 1570681216, 1524410880, 1986861184, 1208741504, 2011464704, 1580734208, 1114618240, 1444094720, 1200514688, 1510314240, 1289750784, 1170698240, 1429523200, 1731440128, 1768029312, 1502447488, 1312821248, 1285001472, 2039450624], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [8, 8, 9, 8, 8, 9, 9, 9, 10, 9, 9, 9, 9, 8, 9, 10, 9, 8, 8, 8, 8, 7, 8, 9, 8, 8, 9, 9, 9, 9, 8, 9], strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.2259418968503937>>, tensor<32x32x3x3xsi8>, tensor<1x32x1x1xi32>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.25557005905511809>> loc(#loc27)
    %28 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc28)
    %29 = "tpu.Lut"(%27, %28) : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.25557005905511809>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.215743762992126>> loc(#loc29)
    %30 = "tpu.Add"(%19, %29) {do_relu = false, multipliers = [113, 102], relu_limit = -1.000000e+00 : f64, rshifts = [7]} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>>, tensor<1x32x160x160x!quant.uniform<i8:f32, 0.215743762992126>>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.26931933149606302>> loc(#loc30)
    %31 = "tpu.Concat"(%18, %19, %30) {axis = 1 : si32, do_relu = false, multipliers = [115, 115, 65], only_merge = false, relu_limit = -1.000000e+00 : f64, rshifts = [7, 7, 6]} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>>, tensor<1x32x160x160x!quant.uniform<i8:f32, 0.23781815511811022>>, tensor<1x32x160x160x!quant.uniform<i8:f32, 0.26931933149606302>>) -> tensor<1x96x160x160x!quant.uniform<i8:f32, 0.26296856299212601>> loc(#loc31)
    %32 = "top.Weight"() : () -> tensor<64x96x1x1xsi8> loc(#loc32)
    %33 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc33)
    %34 = "tpu.Conv2D"(%31, %32, %33) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [1167045888, 1169340416, 1256389632, 1682853376, 1129982848, 1691638400, 1230412672, 1307337472, 2069560320, 1757716864, 1931640064, 1685925760, 1612127488, 1731933056, 1542815232, 1990307584, 2140196608, 1556721664, 1252941184, 1823525376, 1872765440, 1640107008, 1660796544, 1776545280, 1442672640, 1608440576, 1425988608, 1318824064, 1833093504, 1314437376, 1220445952, 1126637312, 1392575872, 1918030848, 1585630720, 1260463872, 1246602880, 1539371904, 2067045760, 2073598208, 1271529216, 1822797568, 1564533632, 2041083264, 1673495808, 1446973824, 1585017984, 2058641024, 1431940992, 1640452352, 1662055296, 1582896256, 1931774720, 1375032064, 1262427136, 1382281472, 1160403968, 1316197504, 1333574784, 1586187648, 1206147584, 1326988928, 1673462912, 1074493312], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [8, 7, 7, 8, 8, 8, 8, 7, 8, 8, 9, 8, 7, 8, 8, 8, 9, 8, 8, 8, 7, 8, 8, 8, 7, 8, 8, 8, 7, 8, 7, 7, 8, 8, 7, 8, 7, 8, 8, 8, 7, 7, 7, 8, 9, 8, 7, 8, 7, 7, 8, 7, 7, 7, 7, 7, 8, 8, 8, 8, 7, 7, 8, 7], strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x96x160x160x!quant.uniform<i8:f32, 0.26296856299212601>>, tensor<64x96x1x1xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.20622726535433072>> loc(#loc34)
    %35 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc35)
    %36 = "tpu.Lut"(%34, %35) : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.20622726535433072>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.12394116614173228>> loc(#loc36)
    %37 = "top.Weight"() : () -> tensor<128x64x3x3xsi8> loc(#loc37)
    %38 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc38)
    %39 = "tpu.Conv2D"(%36, %37, %38) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [2052202496, 1438046208, 1225073536, 1231972736, 2123591936, 1077081088, 1333081216, 1508206976, 1268975744, 1712182784, 1550769280, 1272066944, 1399048192, 1339275776, 1210324224, 1428794496, 1173782272, 1508357760, 1991797248, 1914389888, 1170595840, 2079613184, 1208864512, 1180845056, 1860455552, 2015415552, 1238850432, 1452017664, 1387527552, 1950619008, 1799034496, 1475439488, 1564643072, 1464486400, 1088562304, 1854392192, 1278379264, 1462628224, 1409664128, 1174187648, 1146238080, 1799729280, 2092002048, 1127500032, 1902903168, 1727705728, 1139529856, 1871576960, 1505707776, 1210342400, 1082818048, 1156428416, 1457528704, 1264578816, 2126430592, 1852297600, 1943828992, 1119695616, 1748042624, 1328591360, 1981888128, 1370513664, 1081965824, 1573498752, 2124565888, 1985368576, 1097819648, 1082278528, 1786869376, 1833081856, 1826463232, 1196154240, 1173661184, 1185488256, 1393407872, 1613361536, 1297590656, 2054518656, 1898156032, 1668135296, 1947959296, 2044569344, 1248964096, 1168143872, 2129465088, 1723141248, 1951523456, 1648573952, 1139737856, 1152699392, 1322464384, 1653471616, 1235492736, 1177800704, 1108858496, 1703649024, 1999324160, 1708846080, 1568658944, 1340822272, 1878213632, 1721429504, 1480499072, 1326640768, 1131636352, 1959697664, 1820836736, 1899887488, 1332178048, 1868521984, 1710985216, 1311607808, 1373232128, 1396013824, 1307467264, 1493342080, 1842825472, 1155350656, 1289891072, 2024067328, 2061738368, 1420365952, 1089806080, 2019882112, 1364679936, 1754387584, 1560645120, 1281755392], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [10, 9, 8, 8, 10, 8, 8, 8, 8, 9, 10, 9, 8, 9, 9, 9, 8, 9, 9, 9, 8, 9, 8, 9, 9, 9, 10, 8, 8, 9, 9, 9, 9, 9, 9, 8, 8, 9, 9, 9, 8, 10, 9, 8, 9, 9, 8, 10, 9, 8, 8, 8, 9, 8, 10, 9, 10, 8, 9, 8, 9, 9, 8, 9, 9, 10, 9, 9, 10, 10, 9, 8, 8, 9, 8, 9, 8, 10, 10, 9, 9, 10, 8, 9, 9, 9, 10, 9, 9, 8, 9, 9, 9, 9, 9, 10, 9, 9, 9, 9, 9, 8, 9, 8, 8, 10, 10, 9, 9, 9, 9, 8, 9, 9, 8, 9, 9, 8, 9, 9, 9, 9, 8, 10, 9, 9, 8, 9], strides = [2, 2], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.12394116614173228>>, tensor<128x64x3x3xsi8>, tensor<1x128x1x1xi32>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.08196778897637795>> loc(#loc39)
    %40 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc40)
    %41 = "tpu.Lut"(%39, %40) : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.08196778897637795>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.066642506299212589>> loc(#loc41)
    %42 = "top.Weight"() : () -> tensor<128x128x1x1xsi8> loc(#loc42)
    %43 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc43)
    %44 = "tpu.Conv2D"(%41, %42, %43) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [1173015424, 1295719040, 1354727552, 1418360064, 1300982272, 1490777344, 1401826688, 1291589888, 1833322624, 2066844032, 1295991296, 2073389696, 1697185408, 1197918976, 1603460736, 1280391552, 1314347776, 1994505344, 1729886848, 1190796544, 1294648832, 1127877120, 1125365376, 1772243840, 1699061120, 1809890304, 1528451584, 2039632768, 1786195200, 1391684352, 1336969344, 1914359680, 1236765440, 2081276800, 1323398912, 1177938432, 1191287936, 2010141056, 1218146432, 1636026240, 1904115584, 2120342400, 1298136576, 1302882048, 1209318144, 1612046592, 2007489792, 1440563456, 1921987840, 1665720320, 1633497856, 1548969344, 1520197760, 1451420416, 2017232128, 1082193664, 1718830848, 1354309760, 1481331840, 1155671296, 1477040000, 1973102336, 1335938048, 1921526912, 1581174400, 1813888768, 1172627328, 1160700032, 1173317504, 1533380736, 1087667712, 1357337856, 1446299392, 1095137024, 1755507584, 1906771968, 1734521600, 2137574144, 1784904832, 1132047232, 1090210432, 1804850816, 1827618048, 2049112448, 1470900736, 1638092032, 1287429632, 1944419584, 1181773184, 1685534976, 1189945216, 1721702656, 2016513024, 1390535296, 1644079360, 1376562944, 1930955008, 2078285568, 1243850496, 1558801920, 2107726720, 1160404096, 1320841216, 1177848064, 1105018752, 1092855936, 1731399296, 1881799040, 1591479424, 1469000192, 1558371072, 1262815872, 1138916352, 1922546688, 1588537984, 1494688000, 2102710912, 1151969536, 1175256576, 2085422592, 1338892544, 1459378304, 1472100480, 1127286528, 1256095104, 1139334912, 1468971904, 1972547968], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [8, 8, 8, 8, 8, 7, 7, 7, 9, 9, 7, 8, 7, 8, 7, 7, 8, 8, 8, 7, 8, 7, 8, 8, 8, 8, 8, 7, 7, 7, 8, 9, 7, 8, 8, 7, 7, 8, 7, 9, 8, 8, 6, 8, 6, 7, 7, 7, 8, 8, 8, 7, 8, 7, 9, 6, 7, 7, 8, 8, 7, 8, 7, 8, 9, 9, 8, 9, 9, 9, 9, 9, 9, 8, 9, 9, 8, 10, 9, 8, 9, 9, 9, 10, 8, 9, 8, 10, 9, 8, 8, 10, 9, 9, 9, 9, 9, 9, 9, 9, 10, 8, 9, 8, 9, 8, 9, 10, 9, 8, 9, 9, 9, 10, 10, 9, 10, 8, 9, 9, 8, 9, 8, 8, 8, 9, 8, 9], strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.066642506299212589>>, tensor<128x128x1x1xsi8>, tensor<1x128x1x1xi32>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.096222118897637792>> loc(#loc44)
    %45 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc45)
    %46 = "tpu.Lut"(%44, %45) : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.096222118897637792>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.066550658267716542>> loc(#loc46)
    %47 = "tpu.Slice"(%46, %0, %0, %0, %0) {axes = [], ends = [-1, 64, -1, -1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.066550658267716542>>, none, none, none, none) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.066550658267716542>> loc(#loc47)
    %48 = "tpu.Slice"(%46, %0, %0, %0, %0) {axes = [], ends = [-1, 128, -1, -1], offset = [0, 64, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.066550658267716542>>, none, none, none, none) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.066550658267716542>> loc(#loc48)
    %49 = "top.Weight"() : () -> tensor<64x64x3x3xsi8> loc(#loc49)
    %50 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc50)
    %51 = "tpu.Conv2D"(%48, %49, %50) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1301090944, 1117404928, 1388020224, 1960411904, 1645737472, 1342053888, 1077984128, 1329275392, 1087311360, 1278305536, 1157146112, 1079085824, 1126173440, 1218617472, 1912918144, 1946417408, 1871856256, 1929801728, 1559888384, 2113561472, 1880899072, 1347757056, 1108258304, 2086855808, 1544738304, 1615086976, 2008516864, 1802723584, 1092312320, 1365754496, 1206017664, 1827129216, 1162155904, 1875279744, 1926600320, 1847589632, 1238704640, 2136090112, 1527523328, 1937097344, 1730950144, 1229338752, 1608302464, 1129860736, 1957908480, 1923667328, 2127939712, 1712240000, 1103887488, 2115192192, 1163342336, 1213299968, 1180752256, 2133051136, 1710099200, 1611037184, 2014162816, 1430191488, 1148256000, 1685585536, 1345192448, 1868146560, 2004943616, 1425652736], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [8, 8, 8, 9, 9, 8, 8, 8, 8, 9, 8, 7, 9, 8, 8, 9, 9, 9, 8, 10, 9, 9, 8, 9, 8, 8, 8, 9, 8, 8, 8, 8, 8, 10, 8, 9, 7, 8, 8, 8, 8, 8, 9, 8, 9, 8, 9, 9, 8, 9, 8, 7, 8, 9, 8, 9, 9, 8, 9, 9, 8, 9, 8, 8], strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.066550658267716542>>, tensor<64x64x3x3xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.084716969291338581>> loc(#loc51)
    %52 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc52)
    %53 = "tpu.Lut"(%51, %52) : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.084716969291338581>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.046328659842519687>> loc(#loc53)
    %54 = "top.Weight"() : () -> tensor<64x64x3x3xsi8> loc(#loc54)
    %55 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc55)
    %56 = "tpu.Conv2D"(%53, %54, %55) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1499715200, 1996274560, 1280808704, 1548901504, 1417786880, 1299178752, 1284519296, 1771626752, 1655584512, 1299736320, 1764334336, 1227682688, 1179828480, 1393300224, 2032886016, 1139612672, 1649854464, 1136180480, 2127520000, 1628201984, 1402012032, 1850354944, 1314682240, 1310345600, 1394125312, 1144239232, 1635088512, 1668281088, 1546843136, 1599564544, 1284406656, 1162461056, 1406555136, 1930308096, 2086550144, 2005169280, 2086743168, 2061251840, 1169970304, 1733725056, 1164487552, 1492604800, 1299828992, 1719224064, 1074363520, 1259258240, 1356989568, 1137075840, 1588263680, 1263400576, 1786372096, 1494869376, 2036995584, 2003546624, 1723406592, 1355824128, 1808959744, 1759217536, 1603010176, 1328224128, 1479485952, 2003103488, 1201562496, 1895440768], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [9, 9, 9, 9, 10, 9, 9, 9, 9, 9, 10, 9, 7, 9, 10, 9, 10, 9, 10, 10, 9, 9, 9, 9, 8, 9, 10, 9, 9, 9, 9, 8, 9, 10, 10, 10, 10, 10, 8, 9, 8, 10, 10, 10, 9, 9, 9, 9, 9, 9, 9, 9, 10, 9, 10, 9, 9, 9, 8, 9, 9, 10, 8, 9], strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.046328659842519687>>, tensor<64x64x3x3xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.065331917322834651>> loc(#loc56)
    %57 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc57)
    %58 = "tpu.Lut"(%56, %57) : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.065331917322834651>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.040026512598425198>> loc(#loc58)
    %59 = "tpu.Add"(%48, %58) {do_relu = false, multipliers = [119, 71], relu_limit = -1.000000e+00 : f64, rshifts = [7]} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.066550658267716542>>, tensor<1x64x80x80x!quant.uniform<i8:f32, 0.040026512598425198>>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.071270800000000009>> loc(#loc59)
    %60 = "top.Weight"() : () -> tensor<64x64x3x3xsi8> loc(#loc60)
    %61 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc61)
    %62 = "tpu.Conv2D"(%59, %60, %61) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1376854144, 1527446784, 1749315840, 1492653824, 1417656576, 1254835456, 2098268672, 1243796224, 1309187200, 1796673664, 1669499776, 1982110208, 2009087744, 1421119104, 1375859200, 1926000640, 1161752448, 2121294592, 1271574144, 1725177600, 1179962752, 1382970752, 1807126912, 1771422848, 1480896256, 1203892096, 1580970880, 1538352000, 1444810624, 1626921600, 1115749504, 1796994560, 1388323200, 1178070784, 1838733952, 1952194944, 2069896320, 1168333440, 1405495680, 1830177536, 1270703360, 1131894144, 2050997760, 1239600896, 1466318848, 1081061888, 1856276864, 1302364288, 1476350080, 1733303424, 1594542336, 1237270016, 1319334400, 1256885632, 1767276160, 1702719872, 1339458944, 1706449536, 1214634880, 1295596032, 1831827456, 1365462912, 1673477504, 1633768704], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [9, 9, 8, 9, 10, 8, 10, 8, 9, 8, 9, 9, 10, 8, 8, 10, 9, 9, 9, 9, 8, 9, 8, 9, 9, 9, 9, 9, 9, 9, 8, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 8, 9, 9, 9, 8, 9, 8, 8, 8, 9, 8, 8, 9, 9, 9, 9, 9, 9, 9, 9, 8, 9, 9], strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.071270800000000009>>, tensor<64x64x3x3xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.061430120472440945>> loc(#loc62)
    %63 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc63)
    %64 = "tpu.Lut"(%62, %63) : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.061430120472440945>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.038892557480314963>> loc(#loc64)
    %65 = "top.Weight"() : () -> tensor<64x64x3x3xsi8> loc(#loc65)
    %66 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc66)
    %67 = "tpu.Conv2D"(%64, %65, %66) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1162291968, 1612852608, 1484345088, 1603067776, 1568148864, 1757399040, 1405473536, 1821186304, 1331745792, 2000385664, 1915878912, 1465811840, 1217793408, 2037650816, 1372380032, 2106691328, 1298870784, 1201396608, 1274644864, 1311653248, 1241603584, 1809452672, 1098244736, 1189082112, 1710943744, 1288310400, 1657670528, 1174112768, 1421616896, 1487391488, 1449158912, 1976171264, 1998362624, 1974964224, 1683291264, 1731777024, 1309197056, 1561861376, 1944360960, 1750944768, 1363951488, 1841261056, 1601466112, 1558408960, 1267350656, 1091304064, 1445989760, 1772077312, 1302381696, 1955021952, 1813726208, 1636121088, 1180493312, 2006891904, 1743011968, 1308671872, 1468486144, 1131909504, 1761969152, 1697256192, 1326883968, 2040189696, 1567109760, 1175837440], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [9, 9, 9, 9, 9, 9, 8, 9, 9, 10, 9, 9, 9, 9, 9, 9, 8, 9, 8, 9, 8, 9, 8, 9, 9, 9, 9, 8, 8, 9, 8, 9, 9, 9, 9, 9, 9, 9, 9, 8, 9, 9, 9, 9, 9, 8, 9, 9, 8, 9, 9, 9, 9, 9, 9, 8, 8, 9, 9, 9, 8, 9, 9, 8], strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.038892557480314963>>, tensor<64x64x3x3xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.077801366141732289>> loc(#loc67)
    %68 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc68)
    %69 = "tpu.Lut"(%67, %68) : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.077801366141732289>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.071317785039370085>> loc(#loc69)
    %70 = "tpu.Add"(%59, %69) {do_relu = false, multipliers = [109, 109], relu_limit = -1.000000e+00 : f64, rshifts = [7]} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.071270800000000009>>, tensor<1x64x80x80x!quant.uniform<i8:f32, 0.071317785039370085>>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.08312323700787401>> loc(#loc70)
    %71 = "tpu.Concat"(%47, %48, %59, %70) {axis = 1 : si32, do_relu = false, multipliers = [64, 64, 69, 81], only_merge = false, relu_limit = -1.000000e+00 : f64, rshifts = [6, 6, 6, 6]} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.066550658267716542>>, tensor<1x64x80x80x!quant.uniform<i8:f32, 0.066550658267716542>>, tensor<1x64x80x80x!quant.uniform<i8:f32, 0.071270800000000009>>, tensor<1x64x80x80x!quant.uniform<i8:f32, 0.08312323700787401>>) -> tensor<1x256x80x80x!quant.uniform<i8:f32, 0.065660866141732277>> loc(#loc71)
    %72 = "top.Weight"() : () -> tensor<128x256x1x1xsi8> loc(#loc72)
    %73 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc73)
    %74 = "tpu.Conv2D"(%71, %72, %73) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [1583342336, 1335441408, 1412560256, 1589745024, 1135815680, 1204967168, 1241252224, 1792285440, 1440006912, 1980255232, 2109530624, 2061436032, 1432526080, 1444198528, 1969373952, 1096820224, 1359276288, 1304939264, 1283833600, 1105637888, 1414365824, 1270241280, 1101897088, 1570192768, 1808855552, 1749076352, 1774410752, 2003709568, 1693507968, 1199324288, 1990885120, 1688507264, 1995542400, 1819280896, 1368462976, 1553298432, 1814750976, 1622993792, 1928386176, 1804425344, 1636429440, 1628289280, 1701465088, 1883350400, 1130258432, 1536612224, 1669825792, 1123473024, 1675764864, 1180918528, 1453123072, 1434756992, 1803291008, 2137528320, 1698045568, 1891752448, 1532549888, 1426731520, 1330050304, 1417164928, 1911334272, 1585003776, 1344734592, 1216144512, 1141186944, 1509020928, 1084829952, 2145028480, 1403487104, 1754886528, 1163823360, 1603863936, 1075852416, 1173469696, 1684145792, 1764854016, 1382416768, 1950689536, 1576667008, 1190116608, 1466106112, 1219371776, 1649990912, 1954033792, 2106669568, 2129861376, 1623590016, 1350279936, 2097726976, 1228926720, 1652567680, 1372386944, 1876541568, 1118840704, 1403150080, 1254500992, 1517945728, 1694981248, 1561582720, 1788101504, 1465816960, 1550483328, 1755335040, 1518777728, 1112964864, 1635514368, 1898492032, 1455396992, 1165523200, 1448099712, 1158077056, 1348304128, 1195739264, 2026523392, 1730589568, 1342697344, 1497303808, 1247741056, 1971489408, 2022218240, 1772528512, 1628901760, 1614476416, 1752285312, 1733603712, 1523616000, 1982327424, 1681317632], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [9, 8, 8, 9, 8, 8, 8, 9, 8, 9, 9, 9, 9, 9, 8, 9, 8, 8, 8, 8, 8, 8, 9, 8, 9, 9, 8, 9, 9, 8, 9, 8, 9, 9, 9, 9, 9, 9, 8, 10, 9, 9, 10, 9, 8, 8, 9, 7, 9, 9, 9, 10, 9, 10, 8, 9, 8, 9, 9, 9, 9, 9, 9, 9, 8, 9, 9, 9, 9, 9, 8, 9, 8, 7, 8, 9, 8, 9, 8, 7, 9, 8, 8, 9, 9, 9, 8, 8, 9, 9, 9, 9, 9, 8, 9, 8, 9, 8, 8, 10, 8, 9, 8, 9, 8, 9, 9, 8, 9, 8, 8, 9, 9, 9, 9, 8, 8, 8, 9, 10, 8, 9, 8, 9, 9, 9, 9, 9], strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x80x80x!quant.uniform<i8:f32, 0.065660866141732277>>, tensor<128x256x1x1xsi8>, tensor<1x128x1x1xi32>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.075149491338582675>> loc(#loc74)
    %75 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc75)
    %76 = "tpu.Lut"(%74, %75) : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.075149491338582675>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.05504761181102362>> loc(#loc76)
    %77 = "top.Weight"() : () -> tensor<256x128x3x3xsi8> loc(#loc77)
    %78 = "top.Weight"() : () -> tensor<1x256x1x1xi32> loc(#loc78)
    %79 = "tpu.Conv2D"(%76, %77, %78) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1721454720, 1778333056, 1387415552, 1664514304, 2034158464, 1418207872, 1528444416, 2085824896, 1860855552, 2112162304, 1327941888, 1717711872, 1601085696, 1410650624, 2040507904, 1249453824, 1553485696, 1467722624, 1711230080, 1448061056, 1117666432, 1172492544, 1339794304, 1802640256, 1167113088, 1317273216, 1335036672, 2037561088, 1724959104, 1944467712, 1723804672, 2018630016, 1253685120, 1369758720, 1715614464, 1394974336, 1613454592, 1452974976, 1933394560, 1108815232, 1099139328, 1649097856, 1730817664, 1629872256, 1558231296, 1077758080, 1600312960, 1545136768, 1854941696, 2032400000, 1167063808, 1542307456, 1223828608, 1856777728, 1265237248, 1586398592, 1596633984, 1930828288, 1757834496, 1781378432, 1125784448, 1873864576, 1251301888, 1535186560, 1328204288, 1379481984, 1540558464, 1279318400, 1210043904, 1291627264, 1225484800, 1927408640, 1798217088, 1762962944, 1381023744, 2035822976, 1353226112, 1126096384, 1191818240, 1168214016, 2030363008, 1137633792, 1204858240, 1475228928, 2053308672, 1522326912, 1590913920, 1281938304, 1955415424, 1152628480, 2037954688, 1233368576, 1345831040, 1084556288, 1163495552, 1672865920, 1145731328, 1334851456, 1589020672, 1103410944, 1390938496, 1160098816, 1086167168, 2005290240, 1366298368, 1792197760, 1377214080, 2089929600, 1511398400, 1485418752, 1202433408, 1895330048, 1717691648, 1122634496, 1996425344, 1590408704, 1103717888, 1693194240, 1237182080, 1260199296, 1337744128, 2107811328, 1676847104, 1634962688, 1174871808, 1522745088, 1119922304, 1510735104, 1087873536, 2012266496, 1272315776, 1833096960, 1189241600, 1598931584, 1645244160, 1277510144, 1955774464, 1473578880, 1126602496, 1572546176, 1562009344, 2079139200, 1311630848, 1533192960, 1100531456, 1126012288, 1633369984, 2023595008, 1673853824, 1499183872, 2005304064, 1911233536, 2038129408, 1400553344, 1511950080, 1895595520, 1332497664, 1473339904, 1181219456, 1504735616, 1209904384, 1471859072, 1790528000, 1194948608, 2017694208, 1278952960, 2012797312, 1299915520, 1170899456, 1262050432, 1590529408, 1160253184, 2038120320, 1407661312, 1706260224, 2036970752, 2045869056, 1392705536, 1397262848, 1885496448, 1274591104, 2068316544, 1393772544, 1790158464, 1424389248, 1276158464, 1232787200, 1271569664, 2002489472, 1223192320, 1884215936, 1226621696, 1812074496, 1319088384, 1793971328, 1822004864, 1767509760, 1445720448, 1680587392, 1129051520, 1422125184, 1471037952, 1397195520, 1694232192, 1523672960, 1584505600, 1807081088, 1976341248, 2147226368, 2009830912, 2042149248, 1699211392, 1287645184, 1587572736, 1220276992, 1254005376, 1707292928, 1940352896, 1694259712, 1280957440, 1746848640, 1440615424, 1681511552, 1085124352, 1367095936, 1785507200, 2123885696, 1243809152, 1241862912, 1425723776, 1078706816, 1151946368, 1830892800, 1414849920, 1628342400, 1223107968, 1824727552, 1801683968, 1101486336, 1631065472, 1083435520, 1123201792, 1380990720, 1772228992, 1314967040, 1887699200, 1108290432, 1802782464, 1092242304, 1199216128, 2096981504, 1666357504, 1120235520, 1577741312, 1410475392, 1497493120], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [10, 10, 10, 10, 11, 10, 10, 10, 10, 11, 10, 10, 10, 10, 10, 10, 10, 10, 9, 10, 9, 9, 10, 10, 10, 10, 10, 11, 10, 10, 10, 10, 10, 10, 11, 10, 10, 10, 10, 10, 10, 10, 10, 11, 11, 9, 10, 10, 11, 11, 10, 10, 9, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 11, 10, 9, 10, 10, 10, 10, 10, 9, 11, 10, 10, 10, 11, 10, 11, 10, 10, 10, 10, 10, 9, 10, 10, 10, 10, 10, 9, 10, 10, 10, 10, 11, 10, 10, 10, 10, 10, 10, 11, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 9, 11, 10, 11, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 11, 9, 11, 10, 10, 10, 10, 10, 10, 10, 10, 10, 11, 10, 10, 10, 10, 10, 10, 9, 10, 10, 10, 10, 11, 10, 10, 9, 9, 11, 10, 11, 10, 10, 9, 10, 10, 10, 10, 10, 11, 10, 11, 11, 11, 10, 10, 8, 10, 10, 10, 10, 10, 11, 10, 10, 10, 11, 11, 10, 10, 10, 9, 10, 9, 11, 10, 10, 10, 11, 11, 10, 10, 10, 10, 10, 9, 10, 9, 10, 10, 10, 10, 10, 10, 10, 9, 10, 10, 9, 10, 10, 10, 11, 10, 11, 9, 10, 11, 10, 10, 10, 10, 10], strides = [2, 2], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.05504761181102362>>, tensor<256x128x3x3xsi8>, tensor<1x256x1x1xi32>) -> tensor<1x256x40x40x!quant.uniform<i8:f32, 0.065766281889763772>> loc(#loc79)
    %80 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc80)
    %81 = "tpu.Lut"(%79, %80) : (tensor<1x256x40x40x!quant.uniform<i8:f32, 0.065766281889763772>>, tensor<1x1x1x256xsi8>) -> tensor<1x256x40x40x!quant.uniform<i8:f32, 0.045889892125984252>> loc(#loc81)
    %82 = "top.Weight"() : () -> tensor<256x256x1x1xsi8> loc(#loc82)
    %83 = "top.Weight"() : () -> tensor<1x256x1x1xi32> loc(#loc83)
    %84 = "tpu.Conv2D"(%81, %82, %83) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [2118337152, 1579822080, 1627230336, 1161973632, 1960760320, 1226632320, 2049514368, 2080896000, 1488643840, 1806531456, 2055455744, 1255110784, 1306290176, 1267195776, 1220184960, 1370027776, 1076299776, 1457171712, 1151755904, 1888104576, 1198941312, 1568873856, 1917988608, 2076094848, 1143795584, 2086521984, 2070548096, 1400553344, 1893502336, 1574146304, 1966959872, 1276891776, 1349894912, 1279109632, 1278079232, 1934928384, 1423912064, 1113973760, 1548923648, 1215101568, 1957693184, 2092168704, 1106839168, 1731797120, 2133691520, 1158014592, 1419855744, 1271645312, 1187654016, 1270273408, 1153967488, 1802867840, 1314997248, 1602242432, 1234417664, 1105538304, 1768181248, 1214315648, 1538350976, 1551054208, 1313537408, 1095852544, 1197479680, 1350807808, 1379941504, 1612207232, 1363747968, 1944387584, 1272854016, 1384174848, 1383598976, 1159006464, 2114365696, 1929152000, 1220796672, 1343073664, 1108327552, 1138173184, 1325785472, 1243070976, 1801094784, 1145067136, 1087932800, 1099992448, 1725770368, 1115658624, 1137300608, 1982768768, 1896956416, 2008204288, 2035226368, 1798272384, 2037455360, 1854922368, 1653814912, 2014922752, 1219278464, 1309704320, 1283673600, 1262482432, 1229794432, 1218663040, 1112616704, 1856778240, 2130244480, 1142560640, 1109896704, 1794615168, 2094062976, 1656808064, 1278582144, 1905871872, 1095324672, 1342458368, 1268555264, 1319081216, 2115311616, 1323934848, 1663728896, 1195676928, 1151888512, 1314752896, 1969960064, 1172931456, 1578174976, 1270713728, 1142346368, 1400830336, 1373803904, 1449424128, 1322367872, 1136817792, 1295006976, 1344679424, 1682170752, 1239939968, 1213021568, 1253608576, 1124203520, 1138585344, 1675350528, 1414293248, 1779452672, 1745915136, 1572480128, 1468137344, 1332101120, 1944786304, 1716902400, 1342505344, 1823571456, 1664386176, 1198674432, 2026019328, 1563024000, 1837532800, 1076407168, 1674771200, 1339946752, 1833678336, 1083860224, 1153129088, 1472497792, 1130597504, 1107825536, 1362109696, 1185140224, 1911955968, 1536282496, 1502838528, 1302264960, 1844432640, 1726671104, 1375584384, 1219966848, 1941660160, 1355053824, 1673689984, 1287938304, 1165858432, 2064329472, 1591093376, 1606916736, 1254670848, 1216614656, 1672620672, 1856397952, 1370851328, 1137133184, 1572998912, 1930486144, 1332369408, 1135602304, 1616154368, 1515856768, 1651737344, 1349760512, 1326527488, 1541787776, 1617120256, 2048833280, 1865862784, 1228625792, 1979158272, 1106318464, 1430944640, 1590937856, 1200243840, 2023112448, 1323871360, 1518655488, 1123191808, 1290180480, 1786360960, 1383701760, 1468159232, 1209242368, 1187144064, 1819973760, 1179539456, 1855128320, 1107852416, 1646129152, 1728693504, 1399481344, 1750013440, 1181788544, 2101786752, 1489641216, 1443483520, 1097502592, 1814249728, 1443074688, 1285496960, 1733034368, 1401534080, 2010301824, 1808850304, 2089478784, 1116343296, 1214736896, 1511878528, 1095046912, 1290386816, 1243281408, 1371690752, 1348177536, 1450698368, 1911333632, 1108530176, 1158464640, 1598580864, 1342464768, 1089407232, 1955679872, 1937417088], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [8, 8, 8, 8, 9, 8, 8, 9, 9, 9, 9, 8, 8, 8, 8, 8, 8, 8, 8, 9, 8, 8, 9, 8, 8, 9, 8, 8, 8, 8, 9, 8, 8, 8, 9, 9, 8, 8, 7, 8, 9, 9, 8, 8, 9, 7, 8, 8, 8, 8, 7, 9, 8, 8, 8, 8, 8, 8, 9, 8, 8, 7, 8, 8, 8, 8, 8, 9, 8, 8, 8, 8, 9, 8, 8, 8, 8, 8, 8, 8, 8, 8, 7, 8, 9, 8, 8, 9, 8, 8, 9, 8, 9, 9, 8, 9, 8, 7, 8, 7, 8, 8, 8, 7, 9, 8, 8, 9, 8, 9, 8, 8, 8, 8, 8, 8, 9, 8, 8, 8, 8, 8, 9, 8, 8, 8, 7, 8, 10, 10, 8, 10, 9, 9, 10, 10, 8, 9, 8, 8, 9, 9, 9, 10, 10, 9, 9, 10, 9, 10, 10, 9, 9, 10, 9, 10, 9, 9, 9, 9, 8, 9, 9, 9, 9, 9, 9, 9, 8, 9, 10, 10, 9, 9, 9, 11, 9, 9, 9, 9, 10, 10, 9, 9, 9, 10, 8, 9, 9, 10, 10, 10, 9, 10, 10, 10, 9, 9, 9, 9, 9, 9, 10, 10, 9, 9, 9, 9, 8, 9, 9, 9, 9, 9, 10, 9, 10, 9, 10, 9, 10, 9, 10, 9, 9, 10, 9, 10, 9, 9, 9, 10, 9, 9, 9, 10, 10, 9, 10, 8, 9, 9, 9, 9, 9, 10, 10, 9, 10, 9, 8, 9, 9, 10, 10, 10], strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x40x40x!quant.uniform<i8:f32, 0.045889892125984252>>, tensor<256x256x1x1xsi8>, tensor<1x256x1x1xi32>) -> tensor<1x256x40x40x!quant.uniform<i8:f32, 0.068604169291338585>> loc(#loc84)
    %85 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc85)
    %86 = "tpu.Lut"(%84, %85) : (tensor<1x256x40x40x!quant.uniform<i8:f32, 0.068604169291338585>>, tensor<1x1x1x256xsi8>) -> tensor<1x256x40x40x!quant.uniform<i8:f32, 0.056326437795275595>> loc(#loc86)
    %87 = "tpu.Slice"(%86, %0, %0, %0, %0) {axes = [], ends = [-1, 128, -1, -1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x40x40x!quant.uniform<i8:f32, 0.056326437795275595>>, none, none, none, none) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.056326437795275595>> loc(#loc87)
    %88 = "tpu.Slice"(%86, %0, %0, %0, %0) {axes = [], ends = [-1, 256, -1, -1], offset = [0, 128, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x40x40x!quant.uniform<i8:f32, 0.056326437795275595>>, none, none, none, none) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.056326437795275595>> loc(#loc88)
    %89 = "top.Weight"() : () -> tensor<128x128x3x3xsi8> loc(#loc89)
    %90 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc90)
    %91 = "tpu.Conv2D"(%88, %89, %90) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [2071720064, 1356954240, 1360446592, 1870708224, 1099796096, 1404892160, 1746237568, 1580706176, 1263858560, 1556946304, 1337126144, 1294814208, 1299364480, 1671244800, 1746979840, 1229606656, 1387285888, 1228190080, 1599232640, 1593070080, 1760665984, 1368010880, 1289225856, 1103854720, 1653180032, 1711663744, 1521079552, 1100898816, 1933653120, 1820257536, 1319508352, 1661066624, 1197941376, 1127887360, 1306455040, 1938152960, 1466607360, 1805192320, 1299948544, 1483149184, 1441896960, 1746509824, 1483594624, 1109642624, 1580942464, 1540659712, 1166396032, 1566273664, 1119675776, 1734070784, 1440896128, 1568545664, 1272931072, 2028651904, 1682439040, 1693864576, 1901429888, 1730920576, 1512946176, 1205135616, 1162636928, 1125032832, 1191541888, 1247725696, 1660040192, 1107106816, 1400865152, 1569385216, 1405457152, 1238451456, 1936558848, 1197081600, 1501354752, 1636246912, 1499577856, 2009133696, 2118496512, 2027637888, 2129587840, 1122278016, 1221629696, 1719672832, 1419180032, 1839255552, 1833197312, 1179645696, 1490791424, 1337033344, 1462265088, 1281669632, 1411944192, 1300649600, 1940858752, 1288676096, 1643326720, 1339082240, 1216387968, 1646228480, 1946839936, 2001415424, 1075748480, 2125315968, 1770233088, 1753533440, 1397035136, 1649049856, 1852426240, 1091353728, 1897294848, 1995125760, 1410959744, 1108619776, 2006912768, 1384571776, 1629083904, 1704909568, 1751748864, 1357841408, 1572770048, 1802012800, 1291955200, 1386374528, 1663216256, 1202747904, 1804994944, 1677587712, 1803642112, 2045827584], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [10, 9, 9, 10, 10, 9, 9, 9, 9, 9, 7, 9, 9, 9, 10, 9, 9, 9, 9, 9, 9, 9, 8, 8, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 10, 8, 10, 9, 10, 10, 10, 9, 8, 10, 9, 9, 9, 8, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 10, 8, 9, 9, 7, 9, 9, 8, 8, 9, 10, 9, 10, 10, 10, 9, 9, 10, 9, 9, 9, 8, 9, 9, 9, 9, 9, 8, 9, 8, 9, 10, 9, 9, 10, 9, 8, 10, 9, 9, 10, 8, 9, 7, 10, 10, 9, 8, 9, 9, 9, 9, 8, 9, 9, 9, 10, 9, 9, 10, 9, 8, 9, 10], strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.056326437795275595>>, tensor<128x128x3x3xsi8>, tensor<1x128x1x1xi32>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.060954687401574802>> loc(#loc91)
    %92 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc92)
    %93 = "tpu.Lut"(%91, %92) : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.060954687401574802>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.053819701574803154>> loc(#loc93)
    %94 = "top.Weight"() : () -> tensor<128x128x3x3xsi8> loc(#loc94)
    %95 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc95)
    %96 = "tpu.Conv2D"(%93, %94, %95) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1636354944, 1585559296, 1986910464, 1254932736, 1492672768, 1594755584, 1810266752, 1412481536, 1385971456, 1228290176, 1699866880, 1867649792, 1234153984, 1713028864, 2084817280, 2090990848, 1076115072, 1794394368, 1234510080, 1292319360, 1478686336, 1314366208, 1837835776, 1193382272, 1230575104, 1392763904, 1442868992, 1994061568, 1702317184, 1995669760, 1336392704, 1079275648, 1291911168, 1409837184, 1647424384, 2125741184, 1781088640, 1860044032, 1458923136, 1202154112, 1179092224, 1566452480, 1273875072, 1642187264, 1314188032, 1708878592, 1220484992, 1100722688, 1111667584, 1233576320, 1191119360, 1395169152, 1226923776, 1693446784, 1375508736, 1396252544, 2133796608, 1959134080, 1959696512, 1796428160, 2127759872, 1263998848, 1186029184, 1703088896, 1964103552, 1117009536, 1082911616, 1673944576, 1101653504, 1404019328, 1631882752, 1685901056, 1148701568, 1295150208, 1573530752, 2102682240, 1970084864, 1098357504, 1243156352, 1236598272, 1311428480, 1139936896, 1805094784, 2067680768, 1309740288, 1106217088, 1695822208, 1841550976, 1631907328, 1678173184, 1887601792, 2090996992, 1236366336, 1671078272, 1323383680, 1280846848, 2145595392, 1477440640, 1805330304, 1414024832, 1565802624, 1154991872, 1399781376, 1588009984, 1856815104, 2021875840, 1139581184, 1154997504, 1571632512, 1275666304, 1772283136, 1884379904, 1532022912, 1498405632, 1105257216, 1171259008, 2104496640, 1314515456, 2045937408, 1436267520, 1843257600, 1082643840, 1366768896, 1592807296, 1340685824, 1284563840, 1723941248, 1504103424], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, rshift = [10, 9, 10, 10, 10, 10, 11, 10, 10, 9, 11, 11, 9, 10, 10, 11, 9, 10, 10, 10, 9, 10, 10, 10, 10, 10, 10, 10, 10, 11, 9, 9, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 9, 10, 10, 10, 10, 10, 10, 9, 8, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 9, 10, 10, 10, 10, 9, 9, 10, 10, 10, 11, 9, 10, 9, 9, 8, 10, 11, 10, 9, 10, 11, 10, 10, 11, 11, 10, 10, 10, 9, 11, 8, 10, 10, 10, 10, 9, 10, 10, 10, 9, 10, 10, 10, 10, 11, 10, 10, 9, 10, 10, 10, 11, 10, 10, 10, 10, 10, 10, 10, 10, 10], strides = [1, 1], use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.053819701574803154>>, tensor<128x128x3x3xsi8>, tensor<1x128x1x1xi32>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.07626308661417322>> loc(#loc96)
    %97 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc97)
    %98 = "tpu.Lut"(%96, %97) : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.07626308661417322>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.055568004724409446>> loc(#loc98)
    %99 = "tpu.Add"(%88, %98) {do_relu = false, multipliers = [116, 115], relu_limit = -1.000000e+00 : f64, rshifts = [7]} : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.056326437795275595>>, tensor<1x128x40x40x!quant.uniform<i8:f32, 0.055568004724409446>>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.061820126771653543>> loc(#loc99)
    %100 = "top.Weight"() : () -> tensor<128x128x3x3xsi8> loc(#loc100)
    %101 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc101)
